{
    "CompetenciasProfesionalesPersonalesSociales" : {
	"a" : "Configurar y explotar sistemas informáticos, adaptando la configuración lógica del sistema según las necesidades de uso y los criterios establecidos.",
	"b" : "Aplicar técnicas y procedimientos relacionados con la seguridad en sistemas, servicios y aplicaciones, cumpliendo el plan de seguridad.",
	"c" : "Gestionar servidores de aplicaciones adaptando su configuración en cada caso para permitir el despliegue de aplicaciones web.",
	"d" :"Gestionar bases de datos, interpretando su diseño lógico y verificando integridad, consistencia, seguridad y accesibilidad de los datos.",
	"e":"Desarrollar aplicaciones web con acceso a bases de datos utilizando lenguajes, objetos de acceso y herramientas de mapeo adecuados a las especificaciones.",
	"f": "Integrar contenidos en la lógica de una aplicación web, desarrollando componentes de acceso a datos adecuados a las especificaciones.",
	"g":"Desarrollar interfaces en aplicaciones web de acuerdo con un manual de estilo, utilizando lenguajes de marcas y estándares web.",
	"h": "Desarrollar componentes multimedia para su integración en aplicaciones web, empleando herramientas específicas y siguiendo las especificaciones establecidas.",
	"i":"Integrar componentes multimedia en el interface de una aplicación web, realizando el análisis de interactividad, accesibilidad y usabilidad de la aplicación.",
	"j": "Desarrollar e integrar componentes software en el entorno del servidor web, empleando herramientas y lenguajes específicos, para cumplir las especificaciones de la aplicación.",
	"k": " Desarrollar servicios para integrar sus funciones en otras aplicaciones web, asegurando su funcionalidad.",
	"l": " Integrar servicios y contenidos distribuidos en aplicaciones web, asegurando su funcionalidad.",
	"m": " Completar planes de pruebas verificando el funcionamiento de los componentes software desarrollados, según las especificaciones.",
	"n": " Elaborar y mantener la documentación de los procesos de desarrollo, utilizando herramientas de generación de documentación y control de versiones.",
	"ñ": " Desplegar y distribuir aplicaciones web en distintos ámbitos de implantación, verificando su comportamiento y realizando modificaciones.",
	"o": " Gestionar y/o realizar el mantenimiento de los recursos de su área en función de las cargas de trabajo y el plan de mantenimiento.",
	"p": " Adaptarse a las nuevas situaciones laborales, manteniendo actualizados los conocimientos científicos, técnicos y tecnológicos relativos a su entorno profesional, gestionando su formación y los recursos existentes en el aprendizaje a lo largo de la vida y utilizando las tecnologías de la información y la comunicación.",
	"q": " Resolver situaciones, problemas o contingencias con iniciativa y autonomía en el ámbito de su competencia, con creatividad, innovación y espíritu de mejora en el trabajo personal y en el de los miembros del equipo.",
	"r": " Organizar y coordinar equipos de trabajo, supervisando el desarrollo del mismo, con responsabilidad, manteniendo relaciones fluidas y asumiendo el liderazgo, así como, aportando soluciones a los conflictos grupales que se presentan.",
	"s": " Comunicarse con sus iguales, superiores, clientes y personas bajo su responsabilidad utilizando vías eficaces de comunicación, transmitiendo la información o conocimientos adecuados, y respetando la autonomía y competencia de las personas que intervienen en el ámbito de su trabajo.",
	"t": " Generar entornos seguros en el desarrollo de su trabajo y el de su equipo, supervisando y aplicando los procedimientos de prevención de riesgos laborales y ambientales de acuerdo con lo establecido por la normativa y los objetivos de la empresa.",
	"u": " Supervisar y aplicar procedimientos de gestión de calidad, de accesibilidad universal y de diseño para todos, en las actividades profesionales incluidas en los procesos de producción o prestación de servicios.",
	"v": " Realizar la gestión básica para la creación y funcionamiento de una pequeña empresa y tener iniciativa en su actividad profesional con sentido de la responsabilidad social.",
	"x": " Ejercer sus derechos y cumplir con las obligaciones derivadas de su actividad profesional, de acuerdo con lo establecido en la legislación vigente, participando activamente en la vida económica, social y cultural."
    }
    "CualificacionesINCUAL":
    {
	"Completas":
	{
	    "IFC154_3" :
	    {
		"Nombre":"Desarrollo de aplicaciones con tecnologías Web",
		"UCs":
		{
		    "UC0491_3":"Desarrollar elementos software en el entorno cliente.",
		    "UC0492_3":"Desarrollar elementos software en el entorno servidor.",
		    "UC0493_3":"Implementar, verificar y documentar aplicaciones web en entornos internet, intranet y extranet."
		}
	    }
	},
	"Incompletas":
	{
	    "IFC155_3":
	    {	
		"Nombre":"Programación en lenguajes estructurados de aplicaciones de gestión",
		"UCs":
		{
		    "UC0223_3":" Configurar y explotar sistemas informáticos.",
		    "UC0226_3":"Programar bases de datos relacionales."
		}
	    },
	    "IFC080_3":
	    {
		"Nombre": "Programación con lenguajes orientados a objetos y bases de datos relacionales",
		"UCs":
		{
		    "UC0223_3":"Configurar y explotar sistemas informáticos.",
		    "UC0226_3":"Programar bases de datos relacionales."
		}
	    }
	}
    }
}
