{
    "CompetenciasProfesionalesPersonalesSociales" : {
        "a":"Configurar y explotar sistemas informáticos, adaptando la configuración lógica del sistema según las necesidades de uso y los criterios establecidos.",
        "b":"Aplicar técnicas y procedimientos relacionados con la seguridad en sistemas, servicios y aplicaciones, cumpliendo el plan de seguridad.",
        "c":"Gestionar bases de datos, interpretando su diseño lógico y verificando integridad, consistencia, seguridad y accesibilidad de los datos.",
        "d":"Gestionar entornos de desarrollo adaptando su configuración en cada caso para permitir el desarrollo y despliegue de aplicaciones.",
        "e":"Desarrollar aplicaciones multiplataforma con acceso a bases de datos utilizando lenguajes, librerías y herramientas adecuados a las especificaciones.",
        "f":"Desarrollar aplicaciones implementando un sistema completo de formularios e informes que permitan gestionar de forma integral la información almacenada.",
        "g":"Integrar contenidos gráficos y componentes multimedia en aplicaciones multiplataforma, empleando herramientas específicas y cumpliendo los requerimientos establecidos.",
        "h":"Desarrollar interfaces gráficos de usuario interactivos y con la usabilidad adecuada, empleando componentes visuales estándar o implementando componentes visuales específicos.",
        "i":"Participar en el desarrollo de juegos y aplicaciones en el ámbito del entretenimiento y la educación empleando técnicas, motores y entornos de desarrollo específicos.",
        "j":"Desarrollar aplicaciones para teléfonos móviles, tabletas y otros dispositivos inteligentes empleando técnicas y entornos de desarrollo específicos.",
        "k":"Crear ayudas generales y sensibles al contexto, empleando herramientas específicas e integrándolas en sus correspondientes aplicaciones.",
        "l":"Crear tutoriales, manuales de usuario, de instalación, de configuración y de administración, empleando herramientas específicas.",
        "m":"Empaquetar aplicaciones para su distribución preparando paquetes auto instalables con asistentes incorporados.",
        "n":"Desarrollar aplicaciones multiproceso y multihilo empleando librerías y técnicas de programación específicas.",
        "ñ":"Desarrollar aplicaciones capaces de ofrecer servicios en red empleando mecanismos de comunicación.",
        "o":"Participar en la implantación de sistemas ERP-CRM evaluando la utilidad de cada uno de sus módulos.",
        "p":"Gestionar la información almacenada en sistemas ERP-CRM garantizando su integridad.",
        "q":"Desarrollar componentes personalizados para un sistema ERP-CRM atendiendo a los requerimientos.",
        "r":"Realizar planes de pruebas verificando el funcionamiento de los componentes software desarrollados, según las especificaciones.",
        "s":"Desplegar y distribuir aplicaciones en distintos ámbitos de implantación verificando su comportamiento y realizando las modificaciones necesarias.",
        "t":"Establecer vidas eficaces de relación profesional y comunicación con sus superiores, compañeros y subordinados, respetando la autonomía y competencias de las distintas personas.",
        "u":"Liderar situaciones colectivas que se puedan producir, mediando en conflictos personales y laborales, contribuyendo al establecimiento de un ambiente de trabajo agradable, actuando en todo momento de forma respetuosa y tolerante.",
        "v":"Gestionar su carrera profesional, analizando las oportunidades de empleo, autoempleo y de aprendizaje.",
        "w":"Mantener el espíritu de innovación y actualización en el ámbito de su trabajo para adaptarse a los cambios tecnológicos y organizativos de su entorno profesional.",
        "x":"Crear y gestionar una pequeña empresa, realizando un estudio de viabilidad de productos, de planificación de la producción y de comercialización.",
        "y":"Participar de forma activa en la vida económica, social y cultural, con una actitud crítica y responsable."
    },
    "CualificacionesINCUAL":{
            "Completas":
            {
                "IFC155_3" :
                {
                "Nombre":"Programación en lenguajes estructurados de aplicaciones de gestión",
                "UCs":
                {
                    "UC0223_3":"Configurar y explotar sistemas informáticos.",
                    "UC0226_3":"Programar bases de datos relacionales.",
                    "UC0494_3":"Desarrollar componentes software en lenguajes de programación estructurada."
                }
                },
                "IFC080_3" :
                {
                "Nombre":"Programación con lenguajes orientados a objetos y bases de datos relacionales",
                "UCs":
                {
                    "UC0223_3":"Configurar y explotar sistemas informáticos.",
                    "UC0226_3":"Programar bases de datos relacionales.",
                    "UC0227_3":"Desarrollar componentes software en lenguajes de programación orientados a objetos."
                }
            },
            "Incompletas":
            {
                "IFC363_3":
                {
                "Nombre":"Administración y programación en sistemas de planificación de recursos empresariales y de gestión de relaciones con clientes",
                "UCs":
                {
                    "UC1213_3":" Instalar y configurar sistemas de planificación de recursos empresariales y de gestión de relaciones con clientes."
                }
                },
                "IFC303_3":
                {
                "Nombre": "Programación de sistemas informáticos",
                "UCs":
                {
                    "UC0964_3":"Configurar y explotar sistemas informáticos."
                }
                }
            }
            }
    },
    "ObjetivosGenerales":{
        "a" : "Ajustar la configuración lógica del sistema analizando las necesidades y criterios establecidos para configurar y explotar sistemas informáticos.",
        "b" : "Identificar las necesidades de seguridad analizando vulnerabilidades y verificando el plan preestablecido para aplicar técnicas y procedimientos relacionados con la seguridad en el sistema.",
        "c" : "Interpretar el diseño lógico de bases de datos, analizando y cumpliendo las especificaciones relativas a su aplicación, para gestionar bases de datos.",
        "d" : "Instalar y configurar módulos y complementos, evaluando su funcionalidad, para gestionar entornos de desarrollo.",
        "e" : "Seleccionar y emplear lenguajes, herramientas y librerías, interpretando las especificaciones para desarrollar aplicaciones multiplataforma con acceso a bases de datos.",
        "f" : "Gestionar la información almacenada, planificando e implementando sistemas de formularios e informes para desarrollar aplicaciones de gestión.",
        "g" : "Seleccionar y utilizar herramientas específicas, lenguajes y librerías, evaluando sus posibilidades y siguiendo un manual de estilo, para manipular e integrar en aplicaciones multiplataforma contenidos gráficos y componentes multimedia.",
        "h" : "Emplear herramientas de desarrollo, lenguajes y componentes visuales, siguiendo las especificaciones y verificando interactividad y usabilidad, para desarrollar interfaces gráficos de usuario en aplicaciones multiplataforma.",
        "i" : "Seleccionar y emplear técnicas, motores y entornos de desarrollo, evaluando sus posibilidades, para participar en el desarrollo de juegos y aplicaciones en el ámbito del entretenimiento.",
        "j" : "Seleccionar y emplear técnicas, lenguajes y entornos de desarrollo, evaluando sus posibilidades, para desarrollar aplicaciones en teléfonos móviles, tabletas y otros dispositivos inteligentes.",
        "k" : "Valorar y emplear herramientas específicas, atendiendo a la estructura de los contenidos, para crear ayudas generales y sensibles al contexto.",
        "l" : "Valorar y emplear herramientas específicas, atendiendo a la estructura de los contenidos, para crear tutoriales, manuales de usuario y otros documentos asociados a una aplicación.",
        "m" : "Seleccionar y emplear técnicas y herramientas, evaluando la utilidad de los asistentes de instalación generados, para empaquetar aplicaciones.",
        "n" : "Analizar y aplicar técnicas y librerías específicas, simulando diferentes escenarios, para desarrollar aplicaciones capaces de ofrecer servicios en red.",
        "ñ" : " Analizar y aplicar técnicas y librerías de programación, evaluando su funcionalidad para desarrollar aplicaciones multiproceso y multihilo.",
        "o" : "Reconocer la estructura de los sistemas ERP-CRM, identificando la utilidad de cada uno de sus módulos, para participar en su implantación.",
        "p" : "Realizar consultas, analizando y evaluando su alcance, para gestionar la información almacenada en sistemas ERP-CRM.",
        "q" : "Seleccionar y emplear lenguajes y herramientas, atendiendo a los requerimientos, para desarrollar componentes personalizados en sistemas ERP-CRM.",
        "r" : "Verificar los componentes software desarrollados, analizando las especificaciones, para completar un plan de pruebas.",
        "s" : "Establecer procedimientos, verificando su funcionalidad, para desplegar y distribuir aplicaciones.",
        "t" : "Describir los roles de cada uno de los componentes del grupo de trabajo, identificando en cada caso la responsabilidad asociada, para establecer las relaciones profesionales más convenientes.",
        "u" : "Identificar formas de intervención ante conflictos de tipo personal y laboral, teniendo en cuenta las decisiones más convenientes, para garantizar un entorno de trabajo satisfactorio.",
        "v" : "Identificar y valorar las oportunidades de promoción profesional y de aprendizaje, analizando el contexto del sector, para elegir el itinerario laboral y formativo más conveniente.",
        "w" : "Identificar los cambios tecnológicos, organizativos, económicos y laborales en su actividad, analizando sus implicaciones en el ámbito de trabajo, para mantener el espíritu de innovación.",
        "x" : "Reconocer las oportunidades de negocio, identificando y analizando demandas del mercado para crear y gestionar una pequeña empresa.",
        "y" : "Reconocer sus derechos y deberes como agente activo en la sociedad, analizando el marco legal que regula las condiciones sociales y laborales para participar como ciudadano democrático."
    },
    "ModulosProfesionales":{
        "0483":{
            "nombre":"Sistemas Informáticos",
            "creditos":"10",
            "ResultadosAprendizaje":{
                "RA01":{
                    "Resultado":"Evalúa sistemas informáticos, identificando sus componentes y características.",
                    "CriteriosEvaluacion":{
                    "a":"Se han reconocido los componentes físicos de un sistema informático y sus mecanismos de interconexión.",
                    "b":"Se han clasificado los tipos de memorias, señalando sus características e identifcando sus prestaciones y la función que desarrollan en el conjunto del sistema.",
                    "c":"Se ha verificado el proceso de puesta en marcha de un equipo.",
                    "d":"Se han clasificado, instalado y configurado diferentes tipos de dispositivos periféricos.",
                    "e":"Se han identificado los tipos de redes y sistemas de comunicación.",
                    "f":"Se han identificado los componentes de una red informática.",
                    "g":"Se han interpretado mapas físicos y lógicos de una red informática.",
                    "h":"Se han reconocido las normas de seguridad y prevención de riesgos laborales en el uso de los sistemas informáticos."
                    }
                },
                "RA02": {
                    "Resultado": "Instala sistemas operativos planificando el proceso e interpretando documentación técnica.",
                    "CriteriosEvaluacion": {
                        "a": "Se han identificado los elementos funcionales de un sistema informático.",
                        "b": "Se han analizado las características, funciones y arquitectura de un sistema operativo.",
                        "c": "Se han comparado sistemas operativos en base a sus requisitos, características, campos de aplicación y licencias de uso.",
                        "d": "Se ha planificado el proceso de la instalación de sistemas operativos.",
                        "e": "Se han instalado y actualizado sistemas operativos libres y propietarios.",
                        "f": "Se han aplicado técnicas de actualización y recuperación del sistema.",
                        "g": "Se han utilizado tecnologías de virtualización para instalar y probar sistemas operativos.",
                        "h": "Se han instalado, desinstalado y actualizado aplicaciones.",
                        "i": "Se han documentado los procesos realizados."
                        }
                },
                "RA03": {
                    "Resultado": "Gestiona la información del sistema identificando las estructuras de almacenamiento y aplicando medidas para asegurar la integridad de los datos.",
                    "CriteriosEvaluacion": {
                            "a": "Se han comparado sistemas de archivos.",
                            "b": "Se ha identificado la estructura y función de los directorios del sistema operativo.",
                            "c": "Se han utilizado herramientas en entorno gráfico y comandos para localizar información en el sistema de archivos.",
                            "d": "Se han creado diferentes tipos de particiones y unidades lógicas.",
                            "e": "Se han realizado y restaurado copias de seguridad.",
                            "f": "Se han planificado y automatizado tareas.",
                            "g": "Se han instalado y evaluado utilidades relacionadas con la gestión de información."
                        }
                    },
                    "RA04": {
                        "Resultado": "Gestiona sistemas operativos utilizando comandos y herramientas gráficas y evaluando las necesidades del sistema.",
                        "CriteriosEvaluacion": {
                            "a": "Se han configurado cuentas de usuario locales y grupos.",
                            "b": "Se ha asegurado el acceso al sistema mediante el uso de directivas de cuenta y directivas de contraseñas.",
                            "c": "Se han identificado, arrancado y detenido servicios y procesos.",
                            "d": "Se ha protegido el acceso a la información mediante el uso de permisos locales y listas de control de acceso.",
                            "e": "Se han utilizado comandos para realizar las tareas básicas de configuración y administración del sistema.",
                            "f": "Se ha monitorizado el sistema.",
                            "g": "Se han instalado y evaluado utilidades para el mantenimiento y optimización del sistema.",
                            "h": "Se han evaluado las necesidades del sistema informático en relación con el desarrollo de aplicaciones."
                        }
                    },
                    "RA05": {
                        "Resultado": "Interconecta sistemas en red configurando dispositivos y protocolos.",
                        "CriteriosEvaluacion": {
                            "a": "Se ha configurado el protocolo TCP/IP.",
                            "b": "Se han configurado redes de área local cableadas.",
                            "c": "Se han configurado redes de área local inalámbricas.",
                            "d": "Se han utilizado dispositivos de interconexión de redes.",
                            "e": "Se ha configurado el acceso a redes de área extensa.",
                            "f": "Se han gestionado puertos de comunicaciones.",
                            "g": "Se ha verificado el funcionamiento de la red mediante el uso de comandos y herramientas básicas.",
                            "h": "Se han aplicado protocolos seguros de comunicaciones."
                        }
                    },
                    "RA06": {
                        "Resultado": "Opera sistemas en red gestionando sus recursos e identificando las restricciones de seguridad existentes.",
                        "CriteriosEvaluacion": {
                            "a": "Se ha configurado el acceso a recursos locales y recursos de red.",
                            "b": "Se han identificado y configurado los derechos de usuario y directivas de seguridad.",
                            "c": "Se han explotado servidores de ficheros, servidores de impresión y servidores de aplicaciones.",
                            "d": "Se ha accedido a los servidores utilizando técnicas de conexión remota.",
                            "e": "Se ha evaluado la necesidad de proteger los recursos y el sistema.",
                            "f": "Se han instalado y evaluado utilidades de seguridad básica.",
                            "g": "Se han configurado y explotado dominios."
                        }
                    },
                    "RA07": {
                        "Resultado": "Elabora documentación valorando y utilizando aplicaciones informáticas de propósito general.",
                "CriteriosEvaluacion":{
                            "a":"Se ha clasificado software en función de su licencia y propósito.",
                            "b":"Se han analizado las necesidades específicas de software asociadas al uso de sistemas informáticos en diferentes entornos productivos.",
                            "c":"Se han realizado tareas de documentación mediante el uso de herramientas ofimáticas y de trabajo colaborativo.",
                            "d":"Se han utilizado sistemas de correo y mensajería electrónica.",
                            "e":"Se han utilizado los servicios de transferencia de ficheros.",
                            "f":"Se han utilizado métodos de búsqueda de documentación técnica mediante el uso de servicios de Internet.",
                            "g":"Se han utilizado herramientas de propósito general."
                }
            }
            },
            "horas":"100",
            "UnidadesCompetenciaAcreditadas":
            {
                "UC0223_3":"Configurar y explotar sistemas informáticos."
            },
            "ObjetivosGenerales ": ["a","b","t","u","v","w","x"],
            "CompetenciasTitulo" : ["a","b","l","t","u","v","w","x","y" ]
        },
        "0484":{
                "nombre": "Bases de Datos",
                "creditos": "12",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": "Reconoce los elementos de las bases de datos analizando sus funciones y valorando la utilidad de los sistemas gestores.",
                        "CriteriosEvaluacion": {
                            "a": "Se han analizado los sistemas lógicos de almacenamiento y sus características.",
                            "b": "Se han identificado los distintos tipos de bases de datos según el modelo de datos utilizado.",
                            "c": "Se han identificado los distintos tipos de bases de datos en función de la ubicación de la información.",
                            "d": "Se ha evaluado la utilidad de un sistema gestor de bases de datos.",
                            "e": "Se ha reconocido la función de cada uno de los elementos de un sistema gestor de bases de datos.",
                            "f": "Se han clasificado los sistemas gestores de bases de datos.",
                            "g": "Se ha reconocido la utilidad de las bases de datos distribuidas.",
                            "h": "Se han analizado las políticas de fragmentación de la información.",
                            "i":"Se ha identificado la legislación vigente sobre protección de datos.",
                            "j":"Se han reconocido los conceptos de Big Data y de la inteligencia de negocios."
                        }
                    },
                    "RA02": {
                        "Resultado": "Crea bases de datos definiendo su estructura y las características de sus elementos según el modelo relacional.",
                        "CriteriosEvaluacion": {
                            "a": "Se ha analizado el formato de almacenamiento de la información.",
                            "b": "Se han creado las tablas y las relaciones entre ellas.",
                            "c": "Se han seleccionado los tipos de datos adecuados.",
                            "d": "Se han definido los campos clave en las tablas.",
                            "e": "Se han implantado las restricciones reflejadas en el diseño lógico.",
                            "f": "Se han creado vistas.",
                            "g": "Se han creado los usuarios y se les han asignado privilegios.",
                            "h": "Se han utilizado asistentes, herramientas gráficas y los lenguajes de definición y control de datos."
                        }
                    },
                    "RA03": {
                        "Resultado": "Consulta la información almacenada en una base de datos empleando asistentes, herramientas gráficas y el lenguaje de manipulación de datos.",
                        "CriteriosEvaluacion": {
                            "a": "Se han identificado las herramientas y sentencias para realizar consultas.",
                            "b": "Se han realizado consultas simples sobre una tabla.",
                            "c": "Se han realizado consultas sobre el contenido de varias tablas mediante composiciones internas.",
                            "d": "Se han realizado consultas sobre el contenido de varias tablas mediante composiciones externas.",
                            "e": "Se han realizado consultas resumen.",
                            "f": "Se han realizado consultas con subconsultas.",
                            "g": "Se han realizado consultas que implican múltiples selecciones.",
                            "h": "Se han aplicado criterios de optimización de consultas."
                        }
                    },
                    "RA04": {
                        "Resultado": "Modifica la información almacenada en la base de datos utilizando asistentes, herramientas gráficas y el lenguaje de manipulación de datos.",
                        "CriteriosEvaluacion": {
                            "a": "Se han identificado las herramientas y sentencias para modificar el contenido de la base de datos.",
                            "b": "Se han insertado, borrado y actualizado datos en las tablas.",
                            "c": "Se ha incluido en una tabla la información resultante de la ejecución de una consulta.",
                            "d": "Se han diseñado guiones de sentencias para llevar a cabo tareas complejas.",
                            "e": "Se ha reconocido el funcionamiento de las transacciones.",
                            "f": "Se han anulado parcial o totalmente los cambios producidos por una transacción.",
                            "g": "Se han identificado los efectos de las distintas políticas de bloqueo de registros.",
                            "h": "Se han adoptado medidas para mantener la integridad y consistencia de la información."
                        }
                    },
                    "RA05": {
                        "Resultado": "Desarrolla procedimientos almacenados, evaluando y utilizando las sentencias del lenguaje incorporado en el sistema gestor de bases de datos.",
                        "CriteriosEvaluacion": {
                            "a": "Se han identificado las diversas formas de automatizar tareas.",
                            "b": "Se han reconocido los métodos de ejecución de guiones.",
                            "c": "Se han identificado las herramientas disponibles para editar guiones.",
                            "d": "Se han definido y utilizado guiones para automatizar tareas.",
                            "e": "Se ha hecho uso de las funciones proporcionadas por el sistema gestor.",
                            "f": "Se han definido funciones de usuario.",
                            "g": "Se han utilizado estructuras de control de flujo.",
                            "h": "Se han definido disparadores.",
                            "i": "Se han utilizado cursores."
                        }
                    },
                    "RA06": {
                        "Resultado": "Diseña modelos relacionales normalizados interpretando diagramas entidad/relación.",
                        "CriteriosEvaluacion": {
                            "a": "Se han utilizado herramientas gráficas para representar el diseño lógico.",
                            "b": "Se han identificado las tablas del diseño lógico.",
                            "c": "Se han identificado los campos que forman parte de las tablas del diseño lógico.",
                            "d": "Se han analizado las relaciones entre las tablas del diseño lógico.",
                            "e": "Se han identificado los campos clave.",
                            "f": "Se han aplicado reglas de integridad.",
                            "g": "Se han aplicado reglas de normalización.",
                            "h": "Se han analizado y documentado las restricciones que no pueden plasmarse en el diseño lógico."
                        }
                    },
                    "RA07": {
                        "Resultado": "Gestiona la información almacenada en bases de datos objeto-relacionales, evaluando y utilizando las posibilidades que proporciona el sistema gestor",
                        "CriteriosEvaluacion": {
                            "a": "Se han identificado las características de las bases de datos objeto- relacionales.",
                            "b": "Se han creado tipos de datos objeto, sus atributos y métodos.",
                            "c": "Se han creado tablas de objetos y tablas de columnas tipo objeto.",
                            "d": "Se han creado tipos de datos colección.",
                            "e": "Se han realizado consultas.",
                            "f": "Se ha modificado la información almacenada manteniendo la integridad y consistencia de los datos."
                        }
                    }
                },
                "horas": "105",
                "UnidadesCompetenciaAcreditadas": {
                    "UC0226_3": "Programar bases de datos relacionales."
                },
                "ObjetivosGenerales ": ["c","e","f","p","t"],
                "CompetenciasTitulo" : ["b","c","e","p","t"]
        },
        "0485":{
                "nombre": "Programación",
                "creditos": "14",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": " Reconoce la estructura de un programa informático, identificando y relacionando los elementos propios del lenguaje de programación utilizado.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los bloques que componen la estructura de un programa informático.",
                                    "b": "Se han creado proyectos de desarrollo de aplicaciones",
                                    "c": "Se han utilizado entornos integrados de desarrollo.",
                                    "d": "Se han identificado los distintos tipos de variables y la utilidad específica de cada uno.",
                                    "e": "Se ha modificado el código de un programa para crear y utilizar variables.",
                                    "f": "Se han creado y utilizado constantes y literales.",
                                    "g": "Se han clasificado, reconocido y utilizado en expresiones los operadores del lenguaje.",
                                    "h": "Se ha comprobado el funcionamiento de las conversiones de tipo explícitas e implícitas.",
                                    "i": "Se han introducido comentarios en el código."
                                    }},
    "RA02": {
                        "Resultado": " Escribe y prueba programas sencillos, reconociendo y aplicando los fundamentos de la programación orientada a objetos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los fundamentos de la programación orientada a objetos.",
                                    "b": "Se han escrito programas simples.",
                                    "c": "Se han instanciado objetos a partir de clases predefinidas.",
                                    "d": "Se han utilizado métodos y propiedades de los objetos.",
                                    "e": "Se han escrito llamadas a métodos estáticos.",
                                    "f": "Se han utilizado parámetros en la llamada a métodos.",
                                    "g": "Se han incorporado y utilizado librerías de objetos.",
                                    "h": "Se han utilizado constructores.",
                                    "i": "Se ha utilizado el entorno integrado de desarrollo en la creación y compilación de programas simples."}},
    "RA03": {
                        "Resultado": " Escribe y depura código, analizando y utilizando las estructuras de control del lenguaje.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha escrito y probado código que haga uso de estructuras de selección.",
                                    "b": "Se han utilizado estructuras de repetición.",
                                    "c": "Se han reconocido las posibilidades de las sentencias de salto.",
                                    "d": "Se ha escrito código utilizando control de excepciones.",
                                    "e": "Se han creado programas ejecutables utilizando diferentes estructuras de control.",
                                    "f": "Se han probado y depurado los programas.",
                                    "g": "Se ha comentado y documentado el código."}},
    "RA04": {
                        "Resultado": " Desarrolla programas organizados en clases analizando y aplicando los principios de la programación orientada a objetos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha reconocido la sintaxis, estructura y componentes típicos de una clase.",
                                    "b": "Se han definido clases.",
                                    "c": "Se han definido propiedades y métodos.",
                                    "d": "Se han creado constructores.",
                                    "e": "Se han desarrollado programas que instancien y utilicen objetos de las clases creadas anteriormente.",
                                    "f": "Se han utilizado mecanismos para controlar la visibilidad de las clases y de sus miembros.",
                                    "g": "Se han definido y utilizado clases heredadas.",
                                    "h": "Se han creado y utilizado métodos estáticos.",
                                    "i": "Se han definido y utilizado interfaces.",
                                    "j": "Se han creado y utilizado conjuntos y librerías de clases."}},
    "RA05": {
                        "Resultado": " Realiza operaciones de entrada y salida de información, utilizando procedimientos específicos del lenguaje y librerías de clases.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha utilizado la consola para realizar operaciones de entrada y salida de información.",
                                    "b": "Se han aplicado formatos en la visualización de la información.",
                                    "c": "Se han reconocido las posibilidades de entrada / salida del lenguaje y las librerías asociadas.",
                                    "d": "Se han utilizado ficheros para almacenar y recuperar información.",
                                    "e": "Se han creado programas que utilicen diversos métodos de acceso al contenido de los ficheros.",
                                    "f": "Se han utilizado las herramientas del entorno de desarrollo para crear interfaces gráficos de usuario simples.",
                                    "g": "Se han programado controladores de eventos.",
                                    "h": "Se han escrito programas que utilicen interfaces gráficos para la entrada y salida de información."}},
    "RA06": {
                        "Resultado": " Escribe programas que manipulen información, seleccionando y utilizando tipos avanzados de datos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han escrito programas que utilicen arrays.",
                                    "b": "Se han reconocido las librerías de clases relacionadas con tipos de datos avanzados.",
                                    "c": "Se han utilizado listas para almacenar y procesar información.",
                                    "d": "Se han utilizado iteradores para recorrer los elementos de las listas.",
                                    "e": "Se han reconocido las características y ventajas de cada una de la colecciones de datos disponibles.",
                                    "f": "Se han creado clases y métodos genéricos.",
                                    "g": "Se han utilizado expresiones regulares en la búsqueda de patrones en cadenas de texto.",
                                    "h": "Se han identificado las clases relacionadas con el tratamiento de documentos XML.",
                                    "i": "Se han realizado programas que realicen manipulaciones sobre documentos XML."}},
    "RA07": {
                        "Resultado": " Desarrolla programas, aplicando características avanzadas de los lenguajes orientados a objetos y del entorno de programación.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los conceptos de herencia, superclase y subclase.",
                                    "b": "Se han utilizado modificadores para bloquear y forzar la herencia de clases y métodos.",
                                    "c": "Se ha reconocido la incidencia de los constructores en la herencia.",
                                    "d": "Se han creado clases heredadas que sobrescriban la implementación de métodos de la superclase.",
                                    "e": "Se han diseñado y aplicado jerarquías de clases.",
                                    "f": "Se han probado y depurado las jerarquías de clases.",
                                    "g": "Se han realizado programas que implementen y utilicen jerarquías de clases.",
                                    "h": "Se ha comentado y documentado el código."}},
    "RA08": {
                        "Resultado": " Utiliza bases de datos orientadas a objetos, analizando sus características y aplicando técnicas para mantener la persistencia de la información.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado las características de las bases de datos orientadas a objetos.",
                                    "b": "Se ha analizado su aplicación en el desarrollo de aplicaciones mediante lenguajes orientados a objetos.",
                                    "c": "Se han instalado sistemas gestores de bases de datos orientados a objetos.",
                                    "d": "Se han clasificado y analizado los distintos métodos soportados por los sistemas gestores para la gestión de la información almacenada.",
                                    "e": "Se han creado bases de datos y las estructuras necesarias para el almacenamiento de objetos.",
                                    "f": "Se han programado aplicaciones que almacenen objetos en las bases de datos creadas.",
                                    "g": "Se han realizado programas para recuperar, actualizar y eliminar objetos de las bases de datos.",
                                    "h": "Se han realizado programas para almacenar y gestionar tipos de datos estructurados, compuestos y relacionados."}},
    "RA09": {
                        "Resultado": " Gestiona información almacenada en bases de datos relacionales manteniendo la integridad y la consistencia de los datos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado las características y métodos de acceso a sistemas gestores de bases de datos relacionales.",
                                    "b": "Se han programado conexiones con bases de datos.",
                                    "c": "Se ha escrito código para almacenar información en bases de datos.",
                                    "d": "Se han creado programas para recuperar y mostrar información almacenada en bases de datos.",
                                    "e": "Se han efectuado borrados y modificaciones sobre la información almacenada.",
                                    "f": "Se han creado aplicaciones que ejecuten consultas sobre bases de datos.",
                                    "g": "Se han creado aplicaciones para posibilitar la gestión de información presente en bases de datos relacionales."
                                    }}
            },
                "horas": "135",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["e","j","q","w"],
                "CompetenciasTitulo" : ["e","j","t","w"]
        },
        "0486":{
                "nombre": "Lenguajes de marcas y sistemas de gestión de información",
                "creditos": "5",
                "ResultadosAprendizaje": {
                "RA01": {
                        "Resultado": " Reconoce las características de lenguajes de marcas, analizando e interpretando fragmentos de código.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado las características generales de los lenguajes de marcas.",
                                    "b": "Se han reconocido las ventajas que proporcionan en el tratamiento de la información.",
                                    "c": "Se han clasificado los lenguajes de marcas e identificado los más relevantes.",
                                    "d": "Se han diferenciado sus ámbitos de aplicación.",
                                    "e": "Se han reconocido la necesidad y los ámbitos específicos de aplicación de un lenguaje de marcas de propósito general.",
                                    "f": "Se han analizado las características propias del lenguaje XML.",
                                    "g": "Se han identificado la estructura de un documento XML y sus reglas sintácticas.",
                                    "h": "Se han contrastado la necesidad de crear documentos XML bien formados y la influencia en su procesamiento.",
                                    "i": "Se han identificado las ventajas que aportan los espacios de nombres."}},
                "RA02": {
                        "Resultado": " Utiliza lenguajes de marcas para la transmisión de información a través de la web, analizando la estructura de los documentos e identificando sus elementos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado y clasificado los lenguajes de marcas relacionados con la web y sus diferentes versiones.",
                                    "b": "Se ha analizado la estructura de un documento HTML y se han identificado las secciones que lo componen.",
                                    "c": "Se han reconocido la funcionalidad de las principales etiquetas y los atributos del lenguaje HTML.",
                                    "d": "Se han establecido las semejanzas y diferencias entre los lenguajes HTML y XHTML.",
                                    "e": "Se ha reconocido la utilidad de XHTML en los sistemas de gestión de información.",
                                    "f": "Se han utilizado herramientas en la creación de documentos web.",
                                    "g": "Se han identificado las ventajas que aporta la utilización de hojas de estilo.",
                                    "h": "Se han aplicado hojas de estilo."}},
    "RA03": {
                        "Resultado": " Genera canales de contenidos analizando y utilizando tecnologías de sindicación.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado las ventajas que aporta la sindicación de contenidos en la gestión y transmisión de la información.",
                                    "b": "Se han definido sus ámbitos de aplicación.",
                                    "c": "Se han analizado las tecnologías en que se basa la sindicación de contenidos.",
                                    "d": "Se han identificado la estructura y la sintaxis de un canal de contenidos.",
                                    "e": "Se han creado y validado canales de contenidos.",
                                    "f": "Se ha comprobado la funcionalidad y el acceso a los canales.",
                                    "g": "Se han utilizado herramientas específicas como agregadores y directorios de canales."}},
    "RA04": {
                        "Resultado": " Establece mecanismos de validación para documentos XML utilizando métodos para definir su sintaxis y estructura.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha establecido la necesidad de describir la información transmitida en los documentos XML y sus reglas.",
                                    "b": "Se han identificado las tecnologías relacionadas con la definición de documentos XML.",
                                    "c": "Se ha analizado la estructura y sintaxis específica utilizada en la descripción.",
                                    "d": "Se han creado descripciones de documentos XML.",
                                    "e": "Se han utilizado descripciones en la elaboración y validación de documentos XML.",
                                    "f": "Se han asociado las descripciones con los documentos.",
                                    "g": "Se han utilizado herramientas específicas.",
                                    "h": "Se han documentado las descripciones."}},
    "RA05": {
                        "Resultado": " Realiza conversiones sobre documentos XML utilizando técnicas y herramientas de procesamiento.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha identificado la necesidad de la conversión de documentos XML.",
                                    "b": "Se han establecido ámbitos de aplicación.",
                                    "c": "Se han analizado las tecnologías implicadas y su modo de funcionamiento.",
                                    "d": "Se ha descrito la sintaxis específica utilizada en la conversión y adaptación de documentos XML.",
                                    "e": "Se han creado especificaciones de conversión.",
                                    "f": "Se han identificado y caracterizado herramientas específicas relacionadas con la conversión de documentos XML.",
                                    "g": "Se han realizado conversiones con distintos formatos de salida.",
                                    "h": "Se han documentado y depurado las especificaciones de conversión."}},
    "RA06": {
                        "Resultado": " Gestiona información en formato XML analizando y utilizando tecnologías de almacenamiento y lenguajes de consulta.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los principales métodos de almacenamiento de la información usada en documentos XML.",
                                    "b": "Se han identificado los inconvenientes de almacenar información en formato XML.",
                                    "c": "Se han establecido tecnologías eficientes de almacenamiento de información en función de sus características.",
                                    "d": "Se han utilizado sistemas gestores de bases de datos relacionales en el almacenamiento de información en formato XML.",
                                    "e": "Se han utilizado técnicas específicas para crear documentos XML a partir de información almacenada en bases de datos relacionales.",
                                    "f": "Se han identificado las características de los sistemas gestores de bases de datos nativas XML.",
                                    "g": "Se han instalado y analizado sistemas gestores de bases de datos nativas XML.",
                                    "h": "Se han utilizado técnicas para gestionar la información almacenada en bases de datos nativas XML.",
                                    "i": "Se han identificado lenguajes y herramientas para el tratamiento y almacenamiento de información y su inclusión en documentos XML."}},
    "RA07": {
                        "Resultado": " Opera sistemas empresariales de gestión de información realizando tareas de importación, integración, aseguramiento y extracción de la información.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han reconocido las ventajas de los sistemas de gestión y planificación de recursos empresariales.",
                                    "b": "Se han evaluado las características de las principales aplicaciones de gestión empresarial.",
                                    "c": "Se han instalado aplicaciones de gestión empresarial.",
                                    "d": "Se han configurado y adaptado las aplicaciones.",
                                    "e": "Se ha establecido y verificado el acceso seguro a la información.",
                                    "f": "Se han generado informes.",
                                    "g": "Se han realizado tareas de integración con aplicaciones ofimáticas.",
                                    "h": "Se han realizado procedimientos de extracción de información para su tratamiento e incorporación a diversos sistemas.",
                                    "i": "Se han realizado tareas de asistencia y resolución de incidencias.",
                                    "j": "Se han elaborado documentos relativos a la explotación de la aplicación."}}
                },
                "horas": "70",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["h","p","r"],
                "CompetenciasTitulo" : ["e","f","h","p" ]
        },
        "0487":{
                "nombre": "Entornos de desarrollo",
                "creditos": "6",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": " Reconoce los elementos y herramientas que intervienen en el desarrollo de un programa informático, analizando sus características y las fases en las que actúan hasta llegar a su puesta en funcionamiento.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha reconocido la relación de los programas con los componentes del sistema informático: memoria, procesador y periféricos, entre otros.",
                                    "b": "Se han identificado las fases de desarrollo de una aplicación informática.",
                                    "c": "Se han diferenciado los conceptos de código fuente, código objeto y código ejecutable.",
                                    "d": "Se han reconocido las características de la generación de código intermedio para su ejecución en máquinas virtuales.",
                                    "e": "Se han clasificado los lenguajes de programación.",
                                    "f": "Se ha evaluado la funcionalidad ofrecida por las herramientas utilizadas en programación."}},
                    "RA02": {
                        "Resultado": " Evalúa entornos integrados de desarrollo, analizando, sus características para editar código fuente y generar ejecutables.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han instalado entornos de desarrollo, propietarios y libres.",
                                    "b": "Se han añadido y eliminado módulos en el entorno de desarrollo.",
                                    "c": "Se ha personalizado y automatizado el entorno de desarrollo.",
                                    "d": "Se ha configurado el sistema de actualización del entorno de desarrollo.",
                                    "e": "Se han generado ejecutables a partir de código fuente de diferentes lenguajes en un mismo entorno de desarrollo.",
                                    "f": "Se han generado ejecutables a partir de un mismo código fuente con varios entornos de desarrollo.",
                                    "g": "Se han identificado las características comunes y específicas de diversos entornos de desarrollo."}},
                    "RA03": {
                        "Resultado": " Verifica el funcionamiento de programas, diseñando y realizando pruebas.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los diferentes tipos de pruebas.",
                                    "b": "Se han definido casos de prueba.",
                                    "c": "Se han identificado las herramientas de depuración y prueba de aplicaciones ofrecidas por el entorno de desarrollo.",
                                    "d": "Se han utilizado herramientas de depuración para definir puntos de ruptura y seguimiento.",
                                    "e": "Se han utilizado las herramientas de depuración para examinar y modificar el comportamiento de un programa en tiempo de ejecución.",
                                    "f": "Se han efectuado pruebas unitarias de clases y funciones.",
                                    "g": "Se han implementado pruebas automáticas.",
                                    "h": "Se han documentado las incidencias detectadas."}},
                    "RA04": {
                        "Resultado": " Optimiza código empleando las herramientas disponibles en el entorno de desarrollo.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los patrones de refactorización más usuales.",
                                    "b": "Se han elaborado las pruebas asociadas a la refactorización.",
                                    "c": "Se ha revisado el código fuente usando un analizador de código.",
                                    "d": "Se han identificado las posibilidades de configuración de un analizador de código.",
                                    "e": "Se han aplicado patrones de refactorización con las herramientas que proporciona el entorno de desarrollo.",
                                    "f": "Se ha realizado el control de versiones integrado en el entorno de desarrollo.",
                                    "g": "Se han utilizado herramientas del entorno de desarrollo para documentar las clases."}},
                    "RA05": {
                        "Resultado": " Genera diagramas de clases valorando su importancia en el desarrollo de aplicaciones y empleando las herramientas disponibles en el entorno.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los conceptos básicos de la programación orientada a objetos.",
                                    "b": "Se ha instalado el módulo del entorno integrado de desarrollo que permite la utilización de diagramas de clases.",
                                    "c": "Se han identificado las herramientas para la elaboración de diagramas de clases.",
                                    "d": "Se ha interpretado el significado de diagramas de clases.",
                                    "e": "Se han trazado diagramas de clases a partir de las especificaciones de las mismas.",
                                    "f": "Se ha generado código a partir de un diagrama de clases.",
                                    "g": "Se ha generado un diagrama de clases mediante ingeniería inversa."}},
                    "RA06": {
                        "Resultado": " Genera diagramas de comportamiento valorando su importancia en el desarrollo de aplicaciones y empleando las herramientas disponibles en el entorno.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los distintos tipos de diagramas de comportamiento.",
                                    "b": "Se ha reconocido el significado de los diagramas de casos de uso.",
                                    "c": "Se han interpretado diagramas de interacción.",
                                    "d": "Se han elaborado diagramas de interacción sencillos.",
                                    "e": "Se ha interpretado el significado de diagramas de actividades.",
                                    "f": "Se han elaborado diagramas de actividades sencillos.",
                                    "g": "Se han interpretado diagramas de estados.",
                                    "h": "Se han planteado diagramas de estados sencillos."
                                    }
                    }},
                "horas": "50",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["d","e","h","i","j"],
                "CompetenciasTitulo" : ["d","f","h","i","j"]
        },
        "0179":{
                "nombre": "Inglés Profesional (GS)",
                "creditos": "4",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": " Comprende información, de índole profesional, académica y cotidiana, contenida en todo tipo de discursos orales, emitidos por cualquier medio de comunicación en lengua estándar, interpretando con precisión el contenido del mensaje.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha identificado la idea principal de mensajes en lengua estándar relacionados con la vida social, profesional o académica.",
                                    "b": "Se ha reconocido la finalidad de mensajes directos o emitidos en cualquier soporte en lengua estándar.",
                                    "c": "Se ha extraído información específica contenida en distintos discursos orales en lengua estándar, relacionada con la vida social, profesional o académica.",
                                    "d": "Se ha identificado el punto de vista y la actitud del hablante.",
                                    "e": "Se ha identificado el hilo argumental de mensajes orales y determinado los roles que aparecen en dichos mensajes.",
                                    "f": "Se han comprendido adecuadamente mensajes en lengua estándar en ambientes con contaminación acústica.",
                                    "g": "Se han extraído las ideas principales de conferencias, charlas e informes, y otras formas de presentación académica y profesional, lingüísticamente complejas.",
                                    "h": "Se ha tomado conciencia de la importancia de comprender globalmente un mensaje sin entender todos y cada uno de los elementos del mismo."}},
                    "RA02": {
                        "Resultado": " Comprende mensajes escritos, de naturaleza profesional, académica y cotidiana, de relativa dificultad, analizando de forma comprensiva su contenido.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha identificado la idea principal de textos específicos de su ámbito social, profesional o académico.",
                                    "b": "Se ha reconocido la finalidad de distintos textos escritos en cualquier soporte, en lengua estándar y relacionados con la actividad profesional.",
                                    "c": "Se ha extraído información específica de textos, de diferente naturaleza, relativos a su profesión, y contenidos en distintos soportes.",
                                    "d": "Se ha tomado conciencia de la importancia de comprender globalmente un texto sin entender todos y cada uno de los elementos del mismo.",
                                    "e": "Se han leído y comprendido, de manera autónoma, textos relacionados con el sector con la velocidad y estilo de lectura propia del nivel competencial.",
                                    "f": "Se ha interpretado la correspondencia relativa a su especialidad, captando fácilmente el significado esencial.",
                                    "g": "Se han interpretado textos extensos, y de cierta complejidad, relacionados o no con su especialidad, pudiendo realizar varias lecturas del mismo.",
                                    "h": "Se ha identificado con rapidez el contenido y la importancia de noticias, artículos e informes sobre una amplia serie de temas profesionales.",
                                    "i": "Se han interpretado instrucciones, con distintos niveles de dificultad, y mensajes técnicos recibidos a través de soportes digitales.",
                                    "j": "Se han traducido textos de cierta complejidad, utilizando material de apoyo en caso necesario."}},
                    "RA03": {
                        "Resultado": " Produce mensajes orales claros y bien estructurados, analizando el contenido de la situación y adaptándose al registro lingüístico del interlocutor.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han emitido mensajes generales propios de sector y de la vida cotidiana, utilizando nexos y estrategias de interacción.",
                                    "b": "Se ha intercambiado con fluidez información específica y detallada utilizando estructuras de una complejidad acorde al nivel competencial.",
                                    "c": "Se han seleccionado y aplicado los registros adecuados para la emisión del mensaje, así como protocolos y normas de relación social propios del país.",
                                    "d": "Se han realizado presentaciones, bien estructuradas, sobre temas de su ámbito profesional, haciendo uso de los protocolos establecidos.",
                                    "e": "Se ha utilizado correctamente la terminología de la profesión.",
                                    "f": "Se ha descrito y secuenciado oralmente un proceso de trabajo de su competencia.",
                                    "g": "Se ha solicitado la reformulación del discurso o parte del mismo cuando se ha considerado necesario.",
                                    "h": "Se ha interaccionado espontáneamente, adoptando un nivel de formalidad adecuado a las circunstancias.",
                                    "i": "Se ha expresado con fluidez, precisión y eficacia sobre una amplia serie de temas generales, académicos, profesionales o de ocio, marcando con claridad la relación entre las ideas.",
                                    "j": "Se han expresado y defendido puntos de vista con claridad, proporcionando explicaciones y argumentos adecuados.",
                                    "k": "Se ha respondido a preguntas relativas a su vida socio-profesional, incluidas las propias de una entrevista de trabajo."}},
                    "RA04": {
                        "Resultado": " Redacta documentos e informes, propios del sector o de la vida académica y cotidiana, relacionando los recursos lingüísticos con el propósito de los mismos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han escrito textos claros y detallados sobre una variedad de temas relacionados con su profesión, sintetizando y evaluando información y argumentos procedentes de varias fuentes.",
                                    "b": "Se ha cumplimentado documentación específica de su campo profesional, utilizando vocabulario específico y protocolos y normas de relación social propios del país.",
                                    "c": "Se ha organizado la información con corrección, precisión, con cohesión y coherencia, solicitando y/o facilitando información     de tipo general o detallada.",
                                    "d": "Se han cumplimentado textos mediante apoyos visuales y claves lingüísticas.",
                                    "e": "Se han elaborado informes, destacando los aspectos significativos y ofreciendo detalles relevantes que sirvan de apoyo.",
                                    "f": "Se han escrito cartas, formales e informales, empleando las fórmulas de cortesía establecidas y el vocabulario específico para la elaboración de las mismas.",
                                    "g": "Se han resumido diferentes tipos de documentos escritos, utilizando sus propios recursos lingüísticos.",
                                    "h": "Se han utilizado las fórmulas de cortesía propias del documento que se va a elaborar."}},
                    "RA05": {
                        "Resultado": " Aplica actitudes y comportamientos profesionales en situaciones de comunicación, describiendo las relaciones típicas características del país de la lengua extranjera.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han definido los rasgos más significativos de las costumbres y usos de la comunidad donde se habla la lengua extranjera.",
                                    "b": "Se han descrito los protocolos y normas de relación social propios del país.",
                                    "c": "Se han identificado los valores y creencias propios de la comunidad donde se habla la lengua extranjera.",
                                    "d": "Se ha identificado los aspectos socio-profesionales propios del sector, en cualquier tipo de texto.",
                                    "e": "Se han aplicado los protocolos y normas de relación social propios del país de la lengua extranjera.",
                                    "f": "Se han reconocido los marcadores lingüísticos de la procedencia regional."
                                    }
            }

                },
                "horas": "67",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["e","j","q"],
                "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
        },
        "0486":{
                "nombre": "Acceso a datos",
                "creditos": "9",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado":"Desarrolla aplicaciones que gestionan información almacenada en ficheros identificando el campo de aplicación de los mismos y utilizando clases específicas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han utilizado clases para la gestión de ficheros y directorios.",
                                "b": "Se han valorado las ventajas y los inconvenientes de las distintas formas de acceso.",
                                "c": "Se han utilizado clases para recuperar información almacenada en ficheros.",
                                "d": "Se han utilizado clases para almacenar información en ficheros.",
                                "e": "Se han utilizado clases para realizar conversiones entre diferentes formatos de ficheros.",
                                "f": "Se han previsto y gestionado las excepciones.",
                                "g": "Se han probado y documentado las aplicaciones desarrolladas."}},
                    "RA02": {
                        "Resultado": "Desarrolla aplicaciones que gestionan información almacenada en bases de datos relacionales identificando y utilizando mecanismos de conexión.",
                        "CriteriosEvaluacion": {
                                "a": "Se han valorado las ventajas e inconvenientes de utilizar conectores.",
                                "b": "Se han utilizado gestores de bases de datos embebidos e independientes.",
                                "c": "Se ha utilizado el conector idóneo en la aplicación.",
                                "d": "Se ha establecido la conexión.",
                                "e": "Se ha definido la estructura de la base de datos.",
                                "f": "Se han desarrollado aplicaciones que modifican el contenido de la base de datos.",
                                "g": "Se han definido los objetos destinados a almacenar el resultado de las consultas.",
                                "h": "Se han desarrollado aplicaciones que efectúan consultas.",
                                "i": "Se han eliminado los objetos una vez finalizada su función.",
                                "j": "Se han gestionado las transacciones.",
                                "k": "Se han ejecutado procedimientos almacenados en la base de datos."}},
                    "RA03": {
                        "Resultado": "Gestiona la persistencia de los datos identificando herramientas de mapeo objeto relacional (ORM) y desarrollando aplicaciones que las utilizan.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha instalado la herramienta ORM.",
                                "b": "Se ha configurado la herramienta ORM.",
                                "c": "Se han definido configuraciones de mapeo.",
                                "d": "Se han aplicado mecanismos de persistencia a los objetos.",
                                "e": "Se han desarrollado aplicaciones que modifican y recuperan objetos persistentes.",
                                "f": "Se han desarrollado aplicaciones que realizan consultas usando el lenguaje SQL.",
                                "g": "Se han gestionado las transacciones."}},
                    "RA04": {
                        "Resultado": "Desarrolla aplicaciones que gestionan la información almacenada en bases de datos objeto relacionales y orientadas a objetos valorando sus características y utilizando los mecanismos de acceso incorporados.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado las ventajas e inconvenientes de las bases de datos que almacenan objetos.",
                                "b": "Se han establecido y cerrado conexiones.",
                                "c": "Se ha gestionado la persistencia de objetos simples.",
                                "d": "Se ha gestionado la persistencia de objetos estructurados.",
                                "e": "Se han desarrollado aplicaciones que realizan consultas.",
                                "f": "Se han modificado los objetos almacenados.",
                                "g": "Se han gestionado las transacciones.",
                                "h": "Se han probado y documentado las aplicaciones desarrolladas."}},
                    "RA05": {
                        "Resultado": "Desarrolla aplicaciones que gestionan la información almacenada en bases de datos documentales nativas evaluando y utilizando clases específicas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han valorado las ventajas e inconvenientes de utilizar bases de datos documentales nativas.",
                                "b": "Se ha establecido la conexión con la base de datos.",
                                "c": "Se han desarrollado aplicaciones que efectúan consultas sobre el contenido de la base de datos.",
                                "d": "Se han añadido y eliminado colecciones de la base de datos.",
                                "e": "Se han desarrollado aplicaciones para añadir, modificar y eliminar documentos de la base de datos."}},
                    "RA06": {
                        "Resultado": "Programa componentes de acceso a datos identificando las características que debe poseer un componente y utilizando herramientas de desarrollo.",
                        "CriteriosEvaluacion": {
                                "a": "Se han valorado las ventajas e inconvenientes de utilizar programación orientada a componentes.",
                                "b": "Se han identificado herramientas de desarrollo de componentes.",
                                "c": "Se han programado componentes que gestionan información almacenada en ficheros.",
                                "d": "Se han programado componentes que gestionan mediante conectores información almacenada en bases de datos.",
                                "e": "Se han programado componentes que gestionan información usando mapeo objeto relacional.",
                                "f": "Se han programado componentes que gestionan información almacenada en bases de datos objeto relacionales y orientadas a objetos.",
                                "g": "Se han programado componentes que gestionan información almacenada en una base de datos documental nativa.",
                                "h": "Se han probado y documentado los componentes desarrollados.",
                                "i": "Se han integrado los componentes desarrollados en aplicaciones."
                                }
        }

    },
                "horas": "133",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["b","c","e","f","l","p","r","t"],
                "CompetenciasTitulo" : ["b","c","e","f","l","p","r","t"]
        },
        "0488":{
                "nombre": "Desarrollo de interfaces",
                "creditos": "9",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": "Genera interfaces gráficos de usuario mediante editores visuales utilizando las funcionalidades del editor y adaptando el código generado.",
                        "CriteriosEvaluacion": {
                                "a": "Se han analizado las herramientas y librerías disponibles para la generación de interfaces gráficos.",
                                "b": "Se ha creado un interfaz gráfico utilizando las herramientas de un editor visual.",
                                "c": "Se han utilizado las funciones del editor para ubicar los componentes del interfaz.",
                                "d": "Se han modificado las propiedades de los componentes para adecuarlas a las necesidades de la aplicación.",
                                "e": "Se ha analizado el código generado por el editor visual.",
                                "f": "Se ha modificado el código generado por el editor visual.",
                                "g": "Se han asociado a los eventos las acciones correspondientes.",
                                "h": "Se ha desarrollado una aplicación que incluye el interfaz gráfico obtenido."}},
                    "RA02": {
                        "Resultado": "Genera interfaces naturales de usuario utilizando herramientas visuales.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado las herramientas disponibles para el aprendizaje automático relacionadas con las interfaces de usuario.",
                                "b": "Se ha creado una interfaz natural de usuario utilizando las herramientas disponibles.",
                                "c": "Se ha utilizado el reconocimiento de voz para implementar acciones en las interfaces naturales de usuario.",
                                "d": "Se ha incorporado la detección del movimiento del cuerpo para implementar acciones en las interfaces naturales de usuario.",
                                "e": "Se han integrado elementos de detección de partes del cuerpo para implementar acciones en las interfaces naturales de usuario.",
                                "f": "Se ha integrado la realidad aumentada en los interfaces de usuario."}},
                    "RA03": {
                        "Resultado": "Crea componentes visuales valorando y empleando herramientas específicas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado las herramientas para diseño y prueba de componentes.",
                                "b": "Se han creado componentes visuales.",
                                "c": "Se han definido sus métodos y propiedades con asignación de valores por defecto.",
                                "d": "Se han determinado los eventos a los que debe responder el componente y se les han asociado las acciones correspondientes.",
                                "e": "Se han realizado pruebas unitarias sobre los componentes desarrollados.",
                                "f": "Se han documentado los componentes creados.",
                                "g": "Se han empaquetado componentes.",
                                "h": "Se han programado aplicaciones cuyo interfaz gráfico utiliza los componentes creados."}},
                    "RA04": {
                        "Resultado": "Diseña interfaces gráficas identificando y aplicando criterios de usabilidad y accesibilidad.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado los principales estándares de usabilidad y accesibilidad.",
                                "b": "Se ha valorado la importancia del uso de estándares para la creación de interfaces.",
                                "c": "Se han creado diferentes tipos de menús cuya estructura y contenido siguen los estándares establecidos.",
                                "d": "Se han distribuido las acciones en menús, barras de herramientas, botones de comando, entre otros, siguiendo un criterio coherente.",
                                "e": "Se han distribuido adecuadamente los controles en la interfaz de usuario.",
                                "f": "Se ha utilizado el tipo de control más apropiado en cada caso.",
                                "g": "Se ha diseñado el aspecto de la interfaz de usuario (colores y fuentes entre otros atendiendo a su legibilidad.",
                                "h": "Se ha verificado que los mensajes generados por la aplicación son adecuados en extensión y claridad.",
                                "i": "Se han realizado pruebas para evaluar la usabilidad y accesibilidad de la aplicación."}},
                    "RA05": {
                        "Resultado": "Crea informes evaluando y utilizando herramientas gráficas.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha establecido la estructura del informe.",
                                "b": "Se han generado informes básicos a partir de diferentes fuentes de datos mediante asistentes.",
                                "c": "Se han establecido filtros sobre los valores a presentar en los informes.",
                                "d": "Se han incluido valores calculados, recuentos y totales.",
                                "e": "Se han incluido gráficos generados a partir de los datos.",
                                "f": "Se han utilizado herramientas para generar el código correspondiente a los informes de una aplicación.",
                                "g": "Se ha modificado el código correspondiente a los informes.",
                                "h": "Se ha desarrollado una aplicación que incluye informes incrustados."}},
                    "RA06": {
                        "Resultado": "Documenta aplicaciones seleccionando y utilizando herramientas específicas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado sistemas de generación de ayudas.",
                                "b": "Se han generado ayudas en los formatos habituales.",
                                "c": "Se han generado ayudas sensibles al contexto.",
                                "d": "Se ha documentado la estructura de la información persistente.",
                                "e": "Se ha confeccionado el manual de usuario y la guía de referencia.",
                                "f": "Se han confeccionado los manuales de instalación, configuración y administración.",
                                "g": "Se han confeccionado tutoriales."}},
                    "RA07": {
                        "Resultado": "Prepara aplicaciones para su distribución evaluando y utilizando herramientas específicas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han empaquetado los componentes que requiere la aplicación.",
                                "b": "Se ha personalizado el asistente de instalación.",
                                "c": "Se han generado paquetes de instalación utilizando el entorno de desarrollo.",
                                "d": "Se han generado paquetes de instalación utilizando herramientas externas.",
                                "e": "Se han firmado digitalmente las aplicaciones para su distribución.",
                                "f": "Se han generado paquetes instalables en modo desatendido.",
                                "g": "Se ha preparado el paquete de instalación para que la aplicación pueda ser correctamente desinstalada.",
                                "h": "Se ha preparado la aplicación para ser distribuida a través de diferentes canales de distribución."}},
                    "RA08": {
                        "Resultado": "Evalúa el funcionamiento de aplicaciones diseñando y ejecutando pruebas.",
                            "CriteriosEvaluacion": {
                                "a": "Se ha establecido una estrategia de pruebas.",
                                "b": "Se han realizado pruebas de integración de los distintos elementos.",
                                "c": "Se han realizado pruebas de regresión.",
                                "d": "Se han realizado pruebas de volumen y estrés.",
                                "e": "Se han realizado pruebas de seguridad.",
                                "f": "Se han realizado pruebas de uso de recursos por parte de la aplicación.",
                                "g": "Se ha documentado la estrategia de pruebas y los resultados obtenidos."
                                }
                    }

    },
                "horas": "166",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["d","e","f","g","h","i","j","k","l","m","r","s","t","w"],
                "CompetenciasTitulo" : ["d","e","f","g","h","i","j","k","l","m","r","s","t","w"]
        },
        "0489":{
                "nombre": "Programación multimedia y dispositivos móviles",
                "creditos": "7",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": "Aplica tecnologías de desarrollo para dispositivos móviles evaluando sus características y capacidades.",
                        "CriteriosEvaluacion": {
                                "a": "Se han analizado las limitaciones que plantea la ejecución de aplicaciones en los dispositivos móviles.",
                                "b": "Se han identificado las tecnologías de desarrollo de aplicaciones para dispositivos móviles.",
                                "c": "Se han instalado, configurado y utilizado entornos de trabajo para el desarrollo de aplicaciones para dispositivos móviles.",
                                "d": "Se han identificado configuraciones que clasifican los dispositivos móviles en base a sus características.",
                                "e": "Se han descrito perfiles que establecen la relación entre el dispositivo y la aplicación.",
                                "f": "Se ha analizado la estructura de aplicaciones existentes para dispositivos móviles identificando las clases utilizadas.",
                                "g": "Se han realizado modificaciones sobre aplicaciones existentes.",
                                "h": "Se han utilizado emuladores para comprobar el funcionamiento de las aplicaciones."}},
                    "RA02": {
                        "Resultado": "Desarrolla aplicaciones para dispositivos móviles analizando y empleando las tecnologías y librerías específicas.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha generado la estructura de clases necesaria para la aplicación.",
                                "b": "Se han analizado y utilizado las clases que modelan ventanas, menús, alertas y controles para el desarrollo de aplicaciones gráficas sencillas.",
                                "c": "Se han utilizado las clases necesarias para la conexión y comunicación con dispositivos inalámbricos.",
                                "d": "Se han desarrollado aplicaciones que hacen uso de las funcionalidades proporcionadas por los sensores.",
                                "e": "Se han utilizado las clases necesarias para establecer conexiones y comunicaciones HTTP y HTTPS.",
                                "f": "Se han utilizado las clases necesarias para establecer conexiones con almacenes de datos garantizando la persistencia.",
                                "g": "Se han realizado pruebas de interacción usuario-aplicación para optimizar las aplicaciones desarrolladas a partir de emuladores.",
                                "h": "Se han empaquetado y desplegado las aplicaciones desarrolladas en dispositivos móviles reales.",
                                "i": "Se han documentado los procesos necesarios para el desarrollo de las aplicaciones.",
                                "j": "Se han establecido los permisos requeridos para el funcionamiento de las aplicaciones."}},
                    "RA03": {
                        "Resultado": "Desarrolla programas que integran contenidos multimedia analizando y empleando las tecnologías y librerías específicas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han analizado entornos de desarrollo multimedia.",
                                "b": "Se han reconocido las clases que permiten la captura, procesamiento y almacenamiento de datos multimedia.",
                                "c": "Se han utilizado clases para la conversión de datos multimedia de un formato a otro.",
                                "d": "Se han utilizado clases para procesar datos multimedia.",
                                "e": "Se han utilizado clases para el control de eventos, tipos de media y excepciones, entre otros.",
                                "f": "Se han utilizado clases para la creación y control de animaciones.",
                                "g": "Se han utilizado clases para reproducir contenidos multimedia.",
                                "h": "Se han depurado y documentado los programas desarrollados."}},
                    "RA04": {
                        "Resultado": "Selecciona y prueba motores de juegos analizando la arquitectura de juegos 2D y 3D.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado los elementos que componen la arquitectura de un juego 2D y 3D.",
                                "b": "Se han analizado los componentes de un motor de juegos.",
                                "c": "Se han analizado entornos de desarrollo de juegos.",
                                "d": "Se han analizado diferentes motores de juegos, sus características y funcionalidades.",
                                "e": "Se han identificado los bloques funcionales de un juego existente.",
                                "f": "Se ha reconocido la representación lógica y espacial de una escena gráfica sobre un juego existente."}},
                    "RA05": {
                        "Resultado": "Desarrolla juegos 2D y 3D sencillos utilizando motores de juegos.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha establecido la lógica de un nuevo juego.",
                                "b": "Se han creado los objetos necesarios para el juego y definido sus características.",
                                "c": "Se han creado las escenas del juego y distribuido los objetos en las mismas.",
                                "d": "Se han creado materiales para determinar las propiedades finales de la superficie de un objeto.",
                                "e": "Se han establecido las propiedades físicas de los objetos.",
                                "f": "Se ha incorporado sonido a los diferentes eventos del juego.",
                                "g": "Se han utilizado cámaras y configurado la iluminación.",
                                "h": "Se han desarrollado e implantado juegos para dispositivos móviles.",
                                "i": "Se han realizado pruebas de funcionamiento y optimización de los juegos desarrollados.",
                                "j": "Se han documentado las fases de diseño y desarrollo de los juegos creados."
                                }
                    }
                },
                "horas": "133",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["d","e","g","h","i","j","l","m","n","ñ","s","t","w"],
                "CompetenciasTitulo" : ["d","e","g","h","i","j","l","m","n","ñ","s","t","w"]
        },
        "0490":{
                "nombre": "Programación de servicios y procesos",
                "creditos": "5",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": "Desarrolla aplicaciones compuestas por varios procesos reconociendo y aplicando principios de programación paralela.",
                        "CriteriosEvaluacion": {
                                "a": "Se han reconocido las características de la programación concurrente y sus ámbitos de aplicación.",
                                "b": "Se han identificado las diferencias entre programación paralela y programación distribuida, sus ventajas e inconvenientes.",
                                "c": "Se han analizado las características de los procesos y de su ejecución por el sistema operativo.",
                                "d": "Se han caracterizado los hilos de ejecución y descrito su relación con los procesos.",
                                "e": "Se han utilizado clases para programar aplicaciones que crean subprocesos.",
                                "f": "Se han utilizado mecanismos para compartir información con los subprocesos iniciados.",
                                "g": "Se han utilizado mecanismos para sincronizar y obtener el valor devuelto por los subprocesos iniciados.",
                                "h": "Se han desarrollado aplicaciones que gestionen y utilicen procesos para la ejecución de varias tareas en paralelo.",
                                "i": "Se han depurado y documentado las aplicaciones desarrolladas."}},
                    "RA02": {
                        "Resultado": "Desarrolla aplicaciones compuestas por varios hilos de ejecución analizando y aplicando librerías específicas del lenguaje de programación.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado situaciones en las que resulte útil la utilización de varios hilos en un programa.",
                                "b": "Se han reconocido los mecanismos para crear, iniciar y finalizar hilos.",
                                "c": "Se han programado aplicaciones que implementen varios hilos.",
                                "d": "Se han identificado los posibles estados de ejecución de un hilo y programado aplicaciones que los gestionen.",
                                "e": "Se han utilizado mecanismos para compartir información entre varios hilos de un mismo proceso.",
                                "f": "Se han desarrollado programas formados por varios hilos sincronizados mediante técnicas específicas.",
                                "g": "Se ha establecido y controlado la prioridad de cada uno de los hilos de ejecución.",
                                "h": "Se han depurado y documentado los programas desarrollados.",
                                "i": "Se ha analizado el contexto de ejecución de los hilos.",
                                "j": "Se han analizado librerías específicas del lenguaje de programación que permiten la programacióm multihilo.",
                                "k": "Se han reconocido los problemas derivados de la compartición de información entre los hilos de un mismo proceso."}},
                    "RA03": {
                        "Resultado": "Programa mecanismos de comunicación en red empleando sockets y analizando el escenario de ejecución.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado escenarios que precisan establecer comunicación en red entre varias aplicaciones.",
                                "b": "Se han identificado los roles de cliente y de servidor y sus funciones asociadas.",
                                "c": "Se han reconocido librerías y mecanismos del lenguaje de programación que permiten programar aplicaciones en red.",
                                "d": "Se ha analizado el concepto de socket, sus tipos y características.",
                                "e": "Se han utilizado sockets para programar una aplicación cliente que se comunique con un servidor.",
                                "f": "Se ha desarrollado una aplicación servidor en red y verificado su funcionamiento.",
                                "g": "Se han desarrollado aplicaciones que utilizan sockets para intercambiar",
                                "h": "información.",
                                "i": "Se han utilizado hilos para posibilitar la comunicación simultánea de varios clientes con el servidor.",
                                "j": "Se han caracterizado los modelos de comunicación más usuales en las arquitecturas de aplicaciones distribuidas.",
                                "k": "Se han depurado y documentado las aplicaciones desarrolladas."}},
                    "RA04": {
                        "Resultado": "Desarrolla aplicaciones que ofrecen servicios en red, utilizando librerías de clases y aplicando criterios de eficiencia y disponibilidad.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado diferentes protocolos estándar de comunicación para la implementación de servicios en red.",
                                "b": "Se han reconocido las ventajas de la utilización de protocolos estándar para la comunicación entre aplicaciones y procesos.",
                                "c": "Se han analizado librerías que permitan implementar servicios en red utilizando protocolos estándar de comunicación.",
                                "d": "Se han desarrollado y probado servicios de comunicación en red.",
                                "e": "Se han utilizado clientes de comunicaciones para verificar el funcionamiento de los servicios.",
                                "f": "Se han incorporado mecanismos para posibilitar la comunicación simultánea de varios clientes con el servicio.",
                                "g": "Se ha verificado la disponibilidad del servicio.",
                                "h": "Se han depurado y documentado las aplicaciones desarrolladas."}},
                    "RA05": {
                        "Resultado": "Protege las aplicaciones y los datos definiendo y aplicando criterios de seguridad en el acceso, almacenamiento y transmisión de la información.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado y aplicado principios y prácticas de programación segura.",
                                "b": "Se han analizado las principales técnicas y prácticas criptográficas.",
                                "c": "Se han definido e implantado políticas de seguridad para limitar y controlar el acceso de los usuarios a las aplicaciones desarrolladas.",
                                "d": "Se han utilizado esquemas de seguridad basados en roles.",
                                "e": "Se han empleado algoritmos criptográficos para proteger el acceso a la información almacenada.",
                                "f": "Se han identificado métodos para asegurar la información transmitida.",
                                "g": "Se han desarrollado aplicaciones que utilicen comunicaciones seguras para la transmisión de información.",
                                "h": "Se han depurado y documentado las aplicaciones desarrolladas."
                                }
                    }
                },
                "horas": "67",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["b","e","i","j","l","n","ñ","t","w"],
                "CompetenciasTitulo" : ["b","e","i","j","l","n","ñ","t","w" ]
        },
        "0491":{
                "nombre": "Sistemas de gestión empresarial",
                "creditos": "6",
                "ResultadosAprendizaje": {
                   "RA01": {
                        "Resultado": "Identifica sistemas de planificación de recursos empresariales y de gestión de relaciones con clientes (ERP-CRM) reconociendo sus características y verificando la configuración del sistema informático.",
                        "CriteriosEvaluacion": {
                                "a": "Se han reconocido los diferentes sistemas ERP-CRM que existen en el mercado.",
                                "b": "Se han identificado los diferentes tipos de licencia de los sistemas ERP-CRM.",
                                "c": "Se han comparado sistemas ERP-CRM en función de sus características y requisitos.",
                                "d": "Se ha identificado el sistema operativo adecuado a cada sistema ERP-CRM.",
                                "e": "Se ha identificado el sistema gestor de datos adecuado a cada sistema ERP-CRM.",
                                "f": "Se han verificado las configuraciones del sistema operativo y del gestor de datos para garantizar la funcionalidad del ERP-CRM.",
                                "g": "Se han documentado las operaciones realizadas.",
                                "h": "Se han documentado las incidencias producidas durante el proceso."}},
                    "RA02": {
                        "Resultado": "Implanta sistemas ERP-CRM interpretando la documentación técnica e identificando las diferentes opciones y módulos.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado los módulos que componen el ERP-CRM.",
                                "b": "Se han realizado diferentes tipos de instalaciones.",
                                "c": "Se han configurado los módulos instalados.",
                                "d": "Se han realizado instalaciones adaptadas a las necesidades planteadas en diferentes supuestos.",
                                "e": "Se ha verificado el funcionamiento del ERP-CRM.",
                                "f": "Se han documentado las operaciones realizadas y las incidencias."}},
                    "RA03": {
                        "Resultado": "Realiza operaciones de gestión, consulta y análisis de la información siguiendo las especificaciones de diseño y utilizando las herramientas proporcionadas por los sistemas ERP-CRM.",
                        "CriteriosEvaluacion": {
                                "a": "Se han utilizado herramientas y lenguajes de consulta y manipulación de datos proporcionados por los sistemas ERP-CRM.",
                                "b": "Se han generado formularios.",
                                "c": "Se han generado informes.",
                                "d": "Se han exportado datos e informes.",
                                "e": "Se han automatizado las extracciones de datos mediante procesos.",
                                "f": "Se ha verificado el rendimiento del sistema ERP-CRM.",
                                "g": "Se han documentado las operaciones realizadas y las incidencias observadas.",
                                "h": "Se ha obtenido información relevante a partir de los datos procesados."}},
                    "RA04": {
                        "Resultado": "Adapta sistemas ERP-CRM identificando los requerimientos de un supuesto empresarial y utilizando las herramientas proporcionadas por los mismos.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado las posibilidades de adaptación del ERP-CRM.",
                                "b": "Se han adaptado definiciones de campos, tablas y vistas de la base de datos del ERP-CRM.",
                                "c": "Se han adaptado consultas.",
                                "d": "Se han adaptado interfaces de entrada de datos y de procesos.",
                                "e": "Se han personalizado informes.",
                                "f": "Se han creado paneles de control.",
                                "g": "Se han adaptado procedimientos almacenados de servidor.",
                                "h": "Se han realizado pruebas.",
                                "i": "Se han documentado las operaciones realizadas y las incidencias observadas.",
                                "j": "Se han realizado integraciones con otro sistema de gestión empresarial."}},
                    "RA05": {
                        "Resultado": "Desarrolla componentes para un sistema ERP-CRM analizando y utilizando el lenguaje de programación incorporado.",
                        "CriteriosEvaluacion": {
                                "a": "Se han reconocido las sentencias del lenguaje propio del sistema ERP-CRM.",
                                "b": "Se han utilizado los elementos de programación del lenguaje para crear componentes de manipulación de datos y extracción de información.",
                                "c": "Se han modificado componentes software para añadir nuevas funcionalidades al sistema.",
                                "d": "Se han integrado los nuevos componentes software en el sistema ERP-CRM.",
                                "e": "Se ha verificado el correcto funcionamiento de los componentes creados.",
                                "f": "Se han documentado todos los componentes creados o modificados.",
                                "g": "Se ha analizado la arquitectura del ERP-CRM."
                                }
        }

                },
                "horas": "133",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["a","b","c","e","f","l","o","p","q","r","t","u","w"],
                "CompetenciasTitulo" : ["a","b","c","e","f","l","o","p","q","r","t","u","w"]
        },
        "1708":{
                "nombre": "Sostenibilidad aplicada al sistema productivo",
                "creditos": "5",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": " Identifica los aspectos ambientales, sociales y de gobernanza (ASG) relativos a la sostenibilidad teniendo en cuenta el concepto de desarrollo sostenible y los marcos internacionales que contribuyen a su consecución.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha descrito el concepto de sostenibilidad, estableciendo los marcos internacionales asociados al desarrollo sostenible.",
                                    "b": "Se han identificado los asuntos ambientales, sociales y de gobernanza que influyen en el desarrollo sostenible de las organizaciones empresariales.",
                                    "c": "Se han relacionado los Objetivos de Desarrollo Sostenible ODS,con su importancia para la consecución de la Agenda 2030.",
                                    "d": "Se ha analizado la importancia de identificar los aspectos ASG más relevantes para los grupos de interés de las organizaciones relacionándolos con los riesgos y oportunidades que suponen para la propia organización.",
                                    "e": "Se han identificado los principales estándares de métricas para la evaluación del desempeño en sostenibilidad y su papel en la rendición de cuentas que marca la legislación vigente y las futuras regulaciones en desarrollo.",
                                    "f": "Se ha descrito la inversión socialmente responsable y el papel de los analistas, inversores, agencias e índices de sostenibilidad en el fomento de la sostenibilidad."}},
                    "RA02": {
                        "Resultado": " Caracteriza los retos ambientales y sociales a los que se enfrenta la sociedad, describiendo los impactos sobre las personas y los sectores productivos y proponiendo acciones para minimizarlos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los principales retos ambientales y sociales.",
                                    "b": "Se han relacionado los retos ambientales y sociales con el desarrollo de la actividad económica.",
                                    "c": "Se ha analizado el efecto de los impactos ambientales y sociales sobre las personas y los sectores productivos.",
                                    "d": "Se han identificado las medidas y acciones encaminadas a minimizar los impactos ambientales y sociales.",
                                    "e": "Se ha analizado la importancia de establecer alianzas y trabajar de manera transversal y coordinada para abordar con éxito los retos ambientales y sociales."}},
                    "RA03": {
                        "Resultado": " Establece la aplicación de criterios de sostenibilidad en el desempeño profesional y personal, identificando los elementos necesarios.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los ODS más relevantes para la actividad profesional que realiza.",
                                    "b": "Se han analizado los riesgos y oportunidades que representan los ODS.",
                                    "c": "Se han identificado las acciones necesarias para atender algunos de los retos ambientales y sociales desde la actividad profesional y el entorno personal."}},
                    "RA04": {
                        "Resultado": " Propón productos y servicios responsables teniendo en cuenta los principios de la economía circular.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha caracterizado el modelo de producción y consumo actual.",
                                    "b": "Se han identificado los principios de la economía verde y circular.",
                                    "c": "Se han contrastado los beneficios de la economía verde y circular frente al modelo clásico de producción.",
                                    "d": "Se han aplicado principios de ecodiseño.",
                                    "e": "Se ha analizado el ciclo de vida del producto.",
                                    "f": "Se han identificado los procesos de producción y los criterios de sostenibilidad aplicados."}},
                    "RA05": {
                        "Resultado": " Realiza actividades sostenibles minimizando el impacto de las mismas en el medio ambiente.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha caracterizado el modelo de producción y consumo actual.",
                                    "b": "Se han identificado los principios de la economía verde y circular.",
                                    "c": "Se han contrastado los beneficios de la economía verde y circular frente al modelo clásico de producción.",
                                    "d": "Se ha evaluado el impacto de las actividades personales y profesionales.",
                                    "e": "Se han aplicado principios de ecodiseño.",
                                    "f": "Se han aplicado estrategias sostenibles.",
                                    "g": "Se ha analizado el ciclo de vida del producto.",
                                    "h": "Se han identificado los procesos de producción y los criterios de sostenibilidad aplicados.",
                                    "i": "Se ha aplicado la normativa ambiental."}},
                    "RA06": {
                        "Resultado": " Analiza un plan de sostenibilidad de una empresa del sector, identificando sus grupos de interés, los aspectos ASG materiales y justificando acciones para su gestión y medición.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los principales grupos de interés de la empresa.",
                                    "b": "Se han analizado los aspectos ASG materiales, las expectativas de los grupos de interés y la importancia de los aspectos ASG en relación con los objetivos empresariales.",
                                    "c": "Se han definido acciones encaminadas a minimizar los impactos negativos y aprovechar las oportunidades que plantean los principales aspectos ASG identificados.",
                                    "d": "Se han determinado las métricas de evaluación del desempeño de la empresa de acuerdo con los estándares de sostenibilidad más ampliamente utilizados.",
                                    "e": "Se ha elaborado un informe de sostenibilidad con el plan y los indicadores propuestos."
                                    }
                        }
                    },
                "horas": "30",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["e","j","q"],
                "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
        },
        "1709":{
                "nombre": "Itinerario personal para la empleabilidad I",
                "creditos": "5",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": " Distingue las características del sector productivo y define los puestos de trabajo relacionándolos con las competencias profesionales expresadas en el título.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han analizado las principales oportunidades de empleo y de inserción laboral en el sector profesional, identificando las posibilidades de empleo y analizado sus requerimientos actuales para el perfil profesional.",
                                    "b": "Se ha comparado los diferentes requerimientos exigidos por el mercado laboral con las exigencias para el trabajo en la función pública relacionados con el sector privado.",
                                    "c": "Se ha reflexionado sobre las actitudes y aptitudes requeridas actualmente para la actividad profesional relacionadas con el título, así como las competencias personales y sociales más relevantes para el sector identificando nuestra zona de desarrollo próximo."}},
                    "RA02": {
                        "Resultado": " Adquiere las competencias necesarias para el desempeño de las funciones de nivel básico en Prevención de Riesgos Laborales.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha valorado la importancia de la cultura preventiva en todos los ámbitos actividades de la empresa u organismo equiparado relacionado las condiciones laborales con la salud de la persona trabajadora identificando y clasificando los factores de riesgo en la actividad y los daños derivados de los mismos, especialmente las situaciones de riesgo más habituales en los entornos de trabajo del sector profesional relacionado con el título.",
                                    "b": "Se han clasificado y descrito los tipos de daños profesionales, con especial referencia a accidentes de trabajo y enfermedades profesionales, relacionados con el perfil profesional del título.",
                                    "c": "Se ha determinado la evaluación de riesgos en la empresa u organismo equiparado y definido las técnicas de prevención y de protección que deben aplicarse para evitar los daños en su origen y minimizar sus consecuencias.",
                                    "d": "Se han analizado los protocolos de actuación en caso de emergencia.",
                                    "e": "Se han determinado los principales derechos y deberes en materia de prevención de riesgos laborales.",
                                    "f": "Se han clasificado las distintas formas de gestión de la prevención en la empresa u organismo equiparado, en función de los distintos criterios establecidos en la normativa sobre prevención de riesgos laborales y determinado las formas de representación de las personas trabajadoras en la empresa u organismo equiparado en materia de prevención de riesgos.",
                                    "g": "Se ha valorado la importancia de la existencia de un plan preventivo en la empresa u organismo equiparado que incluya la secuenciación de actuaciones a realizar en caso de emergencia y reflexionado sobre el contenido del mismo.",
                                    "h": "Se han determinado los requisitos y condiciones para la vigilancia de la salud de la persona trabajadora y su importancia como medida de prevención.",
                                    "i": "Se han identificado las técnicas básicas de primeros auxilios que han de ser aplicadas en el lugar del accidente ante distintos tipos de daños y la composición y uso del botiquín." }},
                    "RA03": {
                        "Resultado": " Analiza sus condiciones laborales como persona trabajadora por cuenta ajena identificándolas en los principales tipos de cambios y vicisitudes relevantes que se pueden presentar en la relación laboral en la normativa laboral y especialmente en el convenio colectivo del sector.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han analizado los derechos y obligaciones derivados de la relación laboral, así como las condiciones de trabajo pactadas en un convenio colectivo aplicable al sector profesional relacionado con el título.",
                                    "b": "Se han comparado las principales modalidades de contratación, localizando los diferentes modelos en las fuentes oficiales.",
                                    "c": "Se han identificado las características definitorias de los nuevos entornos de organización del trabajo y los derechos que conlleva.",
                                    "d": "Se han identificado los diferentes componentes del recibo de salario.",
                                    "e": "Se han identificado los recursos laborales existentes ante las diferentes vicisitudes que se pueden dar en la relación laboral.",
                                    "f": "Se ha valorado el papel de laSeguridad Social como pilar esencial para la mejora de la calidad de vida de los ciudadanos.",
                                    "g": "Se han analizado las principales prestaciones derivadas de la suspensión y extinción de la relación laboral."}},
                    "RA04": {
                        "Resultado": " Analiza y evalúa su potencial profesional y sus intereses para guiarse en el proceso de autoorientación y elabora una hoja de ruta para la inserción profesional en base al análisis de las competencias, intereses y destrezas personales.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han evaluado los propios intereses, motivaciones, habilidades y destrezas en el marco de un proceso de autoconocimiento.",
                                    "b": "Se han analizado las cualidades y competencias personales afines a la actividad profesional relacionada con el perfil del título.",
                                    "c": "Se han determinado las competencias personales y sociales con valor para el empleo.",
                                    "d": "Se han señalado las preferencias profesionales, intereses y metas en el marco de un proyecto profesional.",
                                    "e": "Se ha valorado el concepto de autoestima en el proceso de búsqueda de empleo.",
                                    "f": "Se han identificado las fortalezas, debilidades, amenazas y oportunidades propias para la inserción profesional.",
                                    "g": "Se han identificado expectativas de futuro para inserción profesional analizando competencias, intereses y destrezas personales.",
                                    "h": "Se han valorado hitos importantes en la trayectoria vital con valor profesionalizador.",
                                    "i": "Se han identificado los itinerarios formativos profesionales relacionados con el perfil profesional.",
                                    "j": "Se han formulado objetivos profesionales y se ha determinado metas personales y profesionales para la mejora de la empleabilidad y las condiciones de inserción laboral.",
                                    "k": "Se ha trazado un plan de acción para desarrollar las áreas de mejora y potenciar las fortalezas personales con valor para el empleo."}},
                    "RA05": {
                        "Resultado": " Aplica las estrategias para el aprendizaje autónomo reconociendo su valor profesionalizador, diseñando y optimizando su propio entorno de aprendizaje haciendo uso de las tecnologías digitales como herramientas de aprendizaje autónomo, siendo coherente con su identidad digital y sus propios objetivos profesionales planteados en su plan de desarrollo individual.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha tomado conciencia de la responsabilidad individual en el desarrollo profesional valorando la actitud de aprendizaje permanente para el desarrollo de propias y nuevas competencias.",
                                    "b": "Se ha identificado la empleabilidad como capacidad de adaptación al entorno laboral.",
                                    "c": "Se han conocido y utilizado herramientas, fuentes de información, conexiones y actividades para la configuración de un entorno personal de aprendizaje para la empleabilidad.",
                                    "d": "Se ha puesto en práctica la competencia digital para configurar un entorno personal de aprendizaje para la empleabilidad.",
                                    "e": "Se ha analizado el concepto de identidad digital y su impacto en la empleabilidad.",
                                    "f": "Se ha justificado el diseño de su entorno de aprendizaje basado en cómo este mejora la empleabilidad.",
                                    "g": "Se ha elaborado su plan de desarrollo individual como herramienta para la mejora de la empleabilidad.",
                                    "h": "Se han aplicado las herramientas de aprendizaje autónomo para su desarrollo personal y profesional.",
                                    "i": "Se ha diseñado el entorno de aprendizaje que permite alcanzar el plan de desarrollo individual."}}
                },
                "horas": "50",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["e","j","q"],
                "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
        },
        "1710":{
                "nombre": "Itinerario personal para la empleabilidad II",
                "creditos": "5",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": " Planifica y pone en marcha estrategias en los diferentes procesos selectivos de empleo que le permiten mejorar sus posibilidades de inserción laboral.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han determinado las técnicas utilizadas actualmente en el sector para el proceso de selección de personal.",
                                    "b": "Se han desarrollado estrategias para la búsqueda de empleo relacionadas con las técnicas actuales más utilizadas contextualizadas al sector.",
                                    "c": "Se han valorado las actitudes y aptitudes que permiten superar procesos selectivos en el sector privado y en el sector público.",
                                    "d": "Se ha construido una marca personal identificando las necesidades del mercado actual, sus habilidades, destrezas y su aporte de valor."}},
                    "RA02": {
                        "Resultado": " Aplica estrategias relacionadas con las competencias personales, sociales y emocionales para el empleo en búsqueda de la mejora de su empleabilidad.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha valorado la importancia de las competencias personales y sociales en la empleabilidad en el sector de referencia.",
                                    "b": "Se ha participado activamente en el establecimiento de los objetivos del equipo y en la toma de decisiones del mismo y asumido la responsabilidad de las acciones y decisiones del grupo, participando activamente en el logro de unos objetivos compartidos cooperando con otras personas y compartiendo el liderazgo.",
                                    "c": "Se han incorporado al propio proceso de aprendizaje las técnicas y recursos de presentación y comunicación, tanto orales como escritos, adecuados para una comunicación efectiva y afectiva siendo capaz de adaptarlos a cada situación y circunstancias, valorando las oportunidades y dificultades que ofrece cada una de ellas.",
                                    "d": "Se han aplicado técnicas y estrategias para la gestión del tiempo disponible para alcanzar los objetivos tanto individuales como del equipo y programado las actividades necesarias.",
                                    "e": "Se han aplicado estrategias para canalizar las emociones mostrando una actitud flexible en las relaciones con otras personas.",
                                    "f": "Se han desarrollado estrategias para la programación de actividades atendiendo a criterios de organización eficiente y previendo las posibles dificultades.",
                                    "g": "Se ha reaccionado de forma flexible y positiva ante conflictos y situaciones nuevas, aprovechando las oportunidades y gestionando las dificultades haciendo uso de estrategias relacionadas con la inteligencia emocional."}},
                    "RA03": {
                        "Resultado": " Pone en práctica las habilidades emprendedoras necesarias para el desarrollo de procesos de innovación e investigación aplicadas que promuevan la modernización del sector productivo hacia un modelo sostenible.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha identificado el concepto de innovación y su relación con la construcción de una sociedad más sostenible que mejore en el bienestar de los individuos.",
                                    "b": "Se han analizado las distintas metodologías para emprender y su importancia para favorecer la innovación y como fuente de creación de empleo y bienestar social.",
                                    "c": "Se han aplicado las habilidades emprendedoras necesarias para promover el emprendimiento y el intraemprendimiento.",
                                    "d": "Se ha puesto en práctica el trabajo colaborativo como requisito para el desarrollo de procesos de innovación.",
                                    "e": "Se ha desarrollado la competencia digital necesaria para la mejora de los procesos de innovación e investigación aplicadas que promuevan la modernización del sector productivo.",
                                    "f": "Se han incorporado los objetivos de las políticas e iniciativas relacionadas con la sostenibilidad y el medio ambiente a la estrategia empresarial enfocada al desarrollo de un modelo económico y social sostenible."}},
                    "RA04": {
                        "Resultado": " Identifica, define y valida ideas de emprendimiento generadoras de nuevas oportunidades a partir de estrategias de análisis del entorno socio productivo utilizando metodologías ágiles para el emprendimiento.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los problemas de las personas destinatarias potenciales del proyecto emprendedor como paso previo a la propuesta de soluciones que se conviertan en oportunidades.",
                                    "b": "Se ha puesto en práctica el proceso creativo con el fin de conseguir una idea emprendedora que aporte valor económico, social y/o cultural.",
                                    "c": "Se ha diseñado un modelo de negocio y/o gestión derivado de la idea emprendedora.",
                                    "d": "Se han incorporado valores éticos y sociales a la idea emprendedora analizando modelos de balance social.",
                                    "e": "Se ha analizado la contribución de la Economía Circular y la Economía del Bien Común al desarrollo de un modelo económico y social basado en la equidad, la justicia social y la sostenibilidad.",
                                    "f": "Se han analizado los principales componentes del entorno general y específico, y su impacto en la idea emprendedora.",
                                    "g": "Se han realizado entrevistas de problema para validar el perfil y el problema de las personas destinatarias de la idea emprendedora.",
                                    "h": "Se ha validado la solución mediante la creación de prototipos buscando el encaje problema-solución.",
                                    "i": "Se ha experimentado con la puesta en práctica de estrategias de marketing para desarrollar destrezas en técnicas de comunicación y venta."}},
                    "RA05": {
                        "Resultado": " Desarrolla un proyecto emprendedor de innovación social y/o tecnológica aplicada en colaboración con el entorno.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han analizado los conceptos básicos del emprendimiento y la innovación social.",
                                    "b": "Se ha reflexionado sobre la necesidad del liderazgo ético y sostenible en las organizaciones.",
                                    "c": "Se ha reflexionado sobre la tecnología como base para el cambio del modelo productivo.",
                                    "d": "Se han puesto en marcha las estrategias propias del pensamiento de diseño para detectar necesidades sociales y medioambientales.",
                                    "e": "Se han analizado los elementos del diseño de modelos de negocio ecosociales y/o de base tecnológica.",
                                    "f": "Se han alineado metas de desarrollo sostenible con el diseño de modelos de negocio ecosociales y/o de base tecnológica.",
                                    "g": "Se han aplicado las estrategias necesarias para analizar la viabilidad del proyecto emprendedor.",
                                    "h": "Se han investigado las opciones financieras socialmente responsables.",
                                    "i": "Se han definido los agentes implicados en el proyecto, así como su participación en el mismo."
                                    }
                        }
                },
                "horas": "50",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["e","j","q"],
                "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
        },
        "1665":{
                "nombre": "Digitalización aplicada a los sectores productivos (GS)",
                "creditos": "3",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": "Analiza el concepto de digitalización y su repercusión en los sectores productivos teniendo en cuenta la actividad de la empresa e identificando entornos IT (Information Technology: tecnología de la información) y OT (Operation Technology: tecnología de operación) característicos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha descrito en qué consiste el concepto de digitalización.",
                                    "b": "Se ha relacionado la implantación de la tecnología digital con la organización de las empresas.",
                                    "c": "Se han establecido las diferencias y similitudes entre los entornos IT y OT.",
                                    "d": "Se han identificado los departamentos típicos de las empresas que pueden constituir entornos IT.",
                                    "e": "Se han seleccionado las tecnologías típicas de la digitalización en planta y en negocio.",
                                    "f": "Se ha analizado la importancia de la conexión entre entornos IT y OT.",
                                    "g": "Se han analizado las ventajas de digitalizar una empresa industrial de extremo a extremo."}},
                    "RA02": {
                        "Resultado": " Caracteriza las tecnologías habilitadoras digitales necesarias para la adecuación/transformación de las empresas a entornos digitales describiendo sus características y aplicaciones.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado las principales tecnologías habilitadoras digitales.",
                                    "b": "Se han relacionado las THD con el desarrollo de productos y servicios.",
                                    "c": "Se ha relacionado la importancia de las THD con la economía sostenible y eficiente.",
                                    "d": "Se han identificado nuevos mercados generados por las THD.",
                                    "e": "Se ha analizado la implicación de THD tanto en la parte de negocio como en la parte de planta.",
                                    "f": "Se han identificado las mejoras producidas debido a la implantación de las tecnologías habilitadoras en relación con los entornos IT y OT.",
                                    "g": "Se ha elaborado un informe que relacione, las tecnologías con sus características y áreas de aplicación."}},
                    "RA03": {
                        "Resultado": " Identifica sistemas basados en cloud/nube y su influencia en el desarrollo de los sistemas digitales.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los diferentes niveles de la cloud/nube.",
                                    "b": "Se han identificado las principales funciones de la cloud/nube (procesamiento de datos, intercambio de información, ejecución de aplicaciones, entre otros",
                                    "c": "Se ha descrito el concepto de edge computing y su relación con la cloud/nube.",
                                    "d": "Se han definido los conceptos de fog y mist y sus zonas de aplicación en el conjunto.",
                                    "e": "Se han identificado las ventajas que proporciona la utilización de la cloud/nube en los sistemas conectados."}},
                    "RA04": {
                        "Resultado": " Identifica aplicaciones de la IA (inteligencia artificial) en entornos del sector donde está enmarcado el título describiendo las mejoras implícitas en su implementación.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha identificado la importancia de la IA en la automatización de procesos y su optimización.",
                                    "b": "Se ha relacionado la IA con la recogida masiva de datos (Big Data y su tratamiento)",
                                    "c": "Se ha valorado la importancia presente y futura de la IA.",
                                    "d": "Se han identificado los sectores con implantación más relevante de IA.",
                                    "e": "Se han identificado los lenguajes de programación en IA.",
                                    "f": "Se ha descrito como influye la IA en el sector del título."}},
                    "RA05": {
                        "Resultado": " Evalúa la importancia de los datos, así como su protección en una economía digital globalizada, definiendo sistemas de seguridad y ciberseguridad tanto a nivel de equipo/sistema, como globales.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha establecido la diferencia entre dato e información.",
                                    "b": "Se ha descrito el ciclo de vida del dato.",
                                    "c": "Se ha identificado la relación entre Big Data, análisis de datos, machine/ deep learning e inteligencia artificial.",
                                    "d": "Se han descrito las características que definen Big Data.",
                                    "e": "Se han descrito las etapas típicas de la ciencia de datos y su relación en el proceso.",
                                    "f": "Se han descrito los procedimientos de almacenaje de datos en la cloud/nube.",
                                    "g": "Se ha descrito la importancia del cloud computing.",
                                    "h": "Se han identificado los principales objetivos de la ciencia de datos en las diferentes empresas.",
                                    "i": "Se ha valorado la importancia de la seguridad y su regulación en relación con los datos."}},
                    "RA06": {
                        "Resultado": " Desarrolla un proyecto de transformación digital de una empresa de un sector relacionado con el título, teniendo en cuenta los cambios que se deben producir en función de los objetivos de la empresa.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los objetivos estratégicos de la empresa.",
                                    "b": "Se han identificado y alineado las áreas de producción/negocio y de comunicaciones.",
                                    "c": "Se han identificado las áreas susceptibles de ser digitalizadas.",
                                    "d": "Se ha analizado el encaje de AD (áreas digitalizadasentre sí y con las que no lo están.",
                                    "e": "Se han tenido en cuenta las necesidades presentes y futuras de la empresa.",
                                    "f": "Se han relacionado cada una de las áreas con la implantación de las tecnologías.",
                                    "g": "Se han analizado las posibles brechas de seguridad en cada una de las áreas.",
                                    "h": "Se ha definido el tratamiento de los datos y su análisis.",
                                    "i": "Se ha tenido en cuenta la integración entre datos, aplicaciones, plataformas que los soportan, entre otros.",
                                    "j": "Se han documentado los cambios realizados en función de la estrategia.",
                                    "k": "Se han tenido en cuenta la idoneidad de los recursos humanos."
                                }
                    }
                },
                "horas": "30",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": ["e","j","q"],
                "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
        }
    }
}
