{
    "CompetenciasProfesionalesPersonalesSociales" : {
        "a" : " Determinar la logística asociada a las operaciones de instalación, configuración y mantenimiento de sistemas microinformáticos, interpretando la documentación técnica asociada y organizando los recursos necesarios.",
        "b" : " Montar y configurar ordenadores y periféricos, asegurando su funcionamiento en condiciones de calidad y seguridad.",
        "c" : " Instalar y configurar software básico y de aplicación, asegurando su funcionamiento en condiciones de calidad y seguridad.",
        "d" : " Replantear el cableado y la electrónica de redes locales en pequeños entornos y su conexión con redes de área extensa canalizando a un nivel superior los supuestos que así lo requieran.",
        "e" : " Instalar y configurar redes locales cableadas, inalámbricas o mixtas y su conexión a redes públicas, asegurando su funcionamiento en condiciones de calidad y seguridad.",
        "f" : " Instalar, configurar y mantener servicios multiusuario, aplicaciones y dispositivos compartidos en un entorno de red local, atendiendo a las necesidades y requerimientos especificados.",
        "g" : " Realizar las pruebas funcionales en sistemas microinformáticos y redes locales, localizando y diagnosticando disfunciones, para comprobar y ajustar su funcionamiento.",
        "h" : " Mantener sistemas microinformáticos y redes locales, sustituyendo, actualizando y ajustando sus componentes, para asegurar el rendimiento del sistema en condiciones de calidad y seguridad.",
        "i" : " Ejecutar procedimientos establecidos de recuperación de datos y aplicaciones ante fallos y pérdidas de datos en el sistema, para garantizar la integridad y disponibilidad de la información.",
        "j" : " Elaborar documentación técnica y administrativa del sistema, cumpliendo las normas y reglamentación del sector, para su mantenimiento y la asistencia al cliente.",
        "k" : " Elaborar presupuestos de sistemas a medida cumpliendo los requerimientos del cliente.",
        "l" : " Asesorar y asistir al cliente, canalizando a un nivel superior los supuestos que lo requieran, para encontrar soluciones adecuadas a las necesidades de éste.",
        "m" : " Organizar y desarrollar el trabajo asignado manteniendo unas relaciones profesionales adecuadas en el entorno de trabajo.",
        "n" : " Mantener un espíritu constante de innovación y actualización en el ámbito del sector informático.",
        "ñ" : " Utilizar los medios de consulta disponibles, seleccionando el más adecuado en cada caso, para resolver en tiempo razonable supuestos no conocidos y dudas profesionales.",
        "o" : " Aplicar los protocolos y normas de seguridad, calidad y respeto al medio ambiente en las intervenciones realizadas.",
        "p" : " Cumplir con los objetivos de la producción, colaborando con el equipo de trabajo y actuando conforme a los principios de responsabilidad y tolerancia.",
        "q" : " Adaptarse a diferentes puestos de trabajo y nuevas situaciones laborales originados por cambios tecnológicos y organizativos en los procesos productivos.",
        "r" : " Resolver problemas y tomar decisiones individuales siguiendo las normas y procedimientos establecidos definidos dentro del ámbito de su competencia.",
        "s" : " Ejercer sus derechos y cumplir con las obligaciones derivadas de las relaciones laborales, de acuerdo con lo establecido en la legislación vigente.",
        "t" : " Gestionar su carrera profesional, analizando las oportunidades de empleo, autoempleo y aprendizaje.",
        "u" : " Crear y gestionar una pequeña empresa, realizando un estudio de viabilidad de productos, planificación de la producción y comercialización.",
        "v" : " Participar de forma activa en la vida económica, social y cultural, con una actitud crítica y responsable."
    },
    "CualificacionesINCUAL":
    {
	"Completas":
	{
	    "IFC078_2" :
	    {
		"Nombre":"Sistemas microinformáticos.",
		"UCs":
		{
		    "UC0219_2":"Instalar y configurar el software base en sistemas microinformáticos.",
		    "UC0220_2":"Instalar, configurar y verificar los elementos de la red local según procedimientos establecidos.",
		    "UC0221_2":"Instalar, configurar y mantener paquetes informáticos de propósito general y aplicaciones específicas.",
		    "UC0222_2":"Facilitar al usuario la utilización de paquetes informáticos de propósito general y aplicaciones específicas."
		}
	    }
	},
	"Incompletas":
	{
	    "IFC298_2":
	    {	
		"Nombre":"Montaje y reparación de sistemas microinformáticos.",
		"UCs":
		{
		    "UC0953_2":"Montar equipos microinformáticos.",
		    "UC0219_2":"Instalar y configurar el software base en sistemas microinformáticos.",
		    "UC0954_2":"Reparar y ampliar equipamiento microinformático."
		}
	    },
	    "IFC299_2":
	    {
		"Nombre": "Operación de redes departamentales",
		"UCs":
		{
		    "UC0220_2":"Instalar, configurar y verificar los elementos de la red local según procedimientos preestablecidos.",
		    "UC0955_2":"Monitorizar los procesos de comunicaciones de la red local.",
            "UC0956_2":"Realizar los procesos de conexión entre redes privadas y redes públicas."
		}
	    },
	    "IFC300_2":
	    {
	    "Nombre":"Operación de sistemas informáticos",
	    "UCs":{
            "UC0219_2":"Instalar y configurar el software base en sistemas microinformáticos.",
            "UC0957_2":"Mantener y regular el subsistema físico en sistemas informáticos.",
            "UC0958_2":"Ejecutar procedimientos de administración y mantenimiento en el software base y de aplicación del cliente.",
            "UC0959_2":"Mantener la seguridad de los subsistemas físicos y lógicos en sistemas informáticos."
            }
	    }
	}
    },
    "ObjetivosGenerales":{
        "a" : "Organizar los componentes físicos y lógicos que forman un sistema microinformático, interpretando su documentación técnica, para aplicar los medios y métodos adecuados a su instalación, montaje y mantenimiento.",
        "b" : "Identificar, ensamblar y conectar componentes y periféricos utilizando las herramientas adecuadas, aplicando procedimientos, normas y protocolos de calidad y seguridad, para montar y configurar ordenadores y periféricos.",
        "c" : "Reconocer y ejecutar los procedimientos de instalación de sistemas operativos y programas de aplicación, aplicando protocolos de calidad, para instalar y configurar sistemas microinformáticos.",
        "d" : "Representar la posición de los equipos, líneas de transmisión y demás elementos de una red local, analizando la morfología, condiciones y características del despliegue, para replantear el cableado y la electrónica de la red.",
        "e" : "Ubicar y fijar equipos, líneas, canalizaciones y demás elementos de una red local cableada, inalámbrica o mixta, aplicando procedimientos de montaje y protocolos de calidad y seguridad, para instalar y configurar redes locales.",
        "f" : "Interconectar equipos informáticos, dispositivos de red local y de conexión con redes de área extensa, ejecutando los procedimientos para instalar y configurar redes locales.",
        "g" : "Localizar y reparar averías y disfunciones en los componentes físicos y lógicos para mantener sistemas microinformáticos y redes locales.",
        "h" : "Sustituir y ajustar componentes físicos y lógicos para mantener sistemas microinformáticos y redes locales.",
        "i" : "Interpretar y seleccionar información para elaborar documentación técnica y administrativa.",
        "j" : "Valorar el coste de los componentes físicos, lógicos y la mano de obra, para elaborar presupuestos.",
        "k" : "Reconocer características y posibilidades de los componentes físicos y lógicos, para asesorar y asistir a clientes.",
        "l" : "Detectar y analizar cambios tecnológicos para elegir nuevas alternativas y mantenerse actualizado dentro del sector.",
        "m" : "Reconocer y valorar incidencias, determinando sus causas y describiendo las acciones correctoras para resolverlas.",
        "n" : "Analizar y describir procedimientos de calidad, prevención de riesgos laborales y medioambientales, señalando las acciones a realizar en los casos definidos para actuar de acuerdo con las normas estandarizadas.",
        "ñ" : "Valorar las actividades de trabajo en un proceso productivo, identificando su aportación al proceso global para conseguir los objetivos de la producción.",
        "o" : "Identificar y valorar las oportunidades de aprendizaje y empleo, analizando las ofertas y demandas del mercado laboral para gestionar su carrera profesional.",
        "p" : "Reconocer las oportunidades de negocio, identificando y analizando demandas del mercado para crear y gestionar una pequeña empresa.",
        "q" : "Reconocer sus derechos y deberes como agente activo en la sociedad, analizando el marco legal que regula las condiciones sociales y laborales para participar como ciudadano democrático."
    },
    "ModulosProfesionales":{
	"0156":{
	    "nombre":"Inglés Profesional (GM)",
	    "creditos":"10",
	    "ResultadosAprendizaje":{
            "RA01": {
                    "Resultado": " Comprende información, de índole profesional y cotidiana, contenida en discursos orales sencillos, emitidos en lengua estándar, descifrando el contenido global del mensaje, y relacionándolo con los recursos lingüísticos correspondientes.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha situado el mensaje en su contexto por medio del análisis de sus características textuales y contextuales.",
                                "b": "Se ha identificado el hilo argumental de mensajes orales y determinado los roles que aparecen en los mismos.",
                                "c": "Se ha reconocido la finalidad del mensaje, ya se trate de un mensaje directo, telefónico o en cualquier otro medio auditivo.",
                                "d": "Se ha extraído información específica contenida en discursos orales, en lengua estándar, relacionados con la vida social, profesional o académica.",
                                "e": "Se han secuenciado los elementos constituyentes del mensaje.",
                                "f": "Se han identificado y resumido con claridad las ideas principales de un discurso sobre temas conocidos, transmitido por los medios de comunicación y emitido en lengua estándar.",
                                "g": "Se han reconocido las instrucciones orales y se han seguido las indicaciones siendo capaz de concluir si precisan de una respuesta verbal o de una no verbal.",
                                "h": "Se ha tomado conciencia de la importancia de comprender globalmente un mensaje, sin necesidad de entender todos y cada uno de los elementos del mismo.",
                                "i": "Se ha servido del análisis de la entonación y de los elementos visuales para identificar los diversos significados e intenciones comunicativas del emisor."}},
            "RA02": {
                    "Resultado": " Comprende información profesional contenida en textos escritos sencillos, analizando de forma comprensiva su contenido.",
                        "CriteriosEvaluacion": {
                                "a": "Se han seleccionado los materiales de consulta y diccionarios técnicos. para la comprensión del texto.",
                                "b": "Se han leído de forma comprensiva textos claros en lengua estándar.",
                                "c": "Se ha relacionado el texto con el ámbito del sector a que se refiere.",
                                "d": "Se han reconocido las ideas principales de un texto escrito identificando la información relevante, sin necesidad de entender todos y cada uno de los elementos de dicho texto.",
                                "e": "Se ha identificado la terminología utilizada, así como las estructuras gramaticales y demás elementos característicos de cada tipología discursiva.",
                                "f": "Se han realizado traducciones de textos en lengua estándar utilizando material de apoyo en caso necesario.",
                                "g": "Se ha interpretado el mensaje recibido a través de soportes telemáticos o cualquier otro tipo de soporte.",
                                "h": "Se ha reconocido la finalidad de distintos textos escritos en cualquier soporte, en lengua estándar y relacionados con la actividad profesional.",
                                "i": "Se ha extraído información específica de textos de diferente naturaleza, relativos a su profesión y contenidos en distintos soportes."}},
            "RA03": {
                    "Resultado": " Produce mensajes orales sencillos, claros y estructurados, participando como agente activo en conversaciones profesionales.",
                        "CriteriosEvaluacion": {
                                "a": "Se han determinado los registros más adecuados para la emisión del mensaje.",
                                "b": "Se ha comunicado utilizando fórmulas, nexos de unión, marcadores discursivos y estrategias de interacción acordes a la situación de comunicación.",
                                "c": "Se han descrito hechos breves e imprevistos relacionados con su profesión.",
                                "d": "Se ha utilizado correctamente la terminología de la profesión.",
                                "e": "Se han expresado sentimientos, ideas u opiniones.",
                                "f": "Se han enumerado las actividades propias de la tarea profesional.",
                                "g": "Se ha descrito y secuenciado un proceso de trabajo de su competencia.",
                                "h": "Se ha justificado la aceptación o no de propuestas realizadas haciendo uso de normas de cortesía y de modales apropiados.",
                                "i": "Se ha intercambiado, con relativa fluidez, información específica y detallada utilizando frases de estructura sencilla y diferentes soportes telemáticos.",
                                "j": "Se han realizado, de manera clara, presentaciones breves y preparadas sobre un tema dentro de su especialidad, haciendo uso de los protocolos adecuados.",
                                "k": "Se ha comunicado espontáneamente adoptando un nivel de formalidad adecuado a las circunstancias.",
                                "l": "Se han respondido preguntas relativas a su vida socio-profesional, incluidas las propias de una entrevista de trabajo.",
                                "m": "Se ha solicitado la reformulación del discurso o la aclaración de parte del mismo cuando se ha considerado necesario para una mejor comprensión."}},
            "RA04": {
                    "Resultado": " Redacta textos sencillos en lengua estándar, relacionando las reglas gramaticales con la finalidad de los mismos.",
                        "CriteriosEvaluacion": {
                                "a": "Se han seleccionado las estrategias, estructuras, vocabulario y convenciones más adecuadas para el tipo de texto que se va a crear (fax, nota, carta o correo electrónico, entre otros",
                                "b": "Se han redactado textos breves relacionados con aspectos cotidianos y/o profesionales.",
                                "c": "Se ha organizado la información de manera coherente y cohesionada.",
                                "d": "Se han realizado resúmenes de textos relacionados con su entorno profesional, identificando las ideas principales de los mismos.",
                                "e": "Se ha cumplimentado documentación específica de su campo profesional, aplicando las fórmulas establecidas y el vocabulario específico.",
                                "f": "Se ha cumplimentado un texto dado con apoyos visuales y claves lingüísticas aportadas.",
                                "g": "Se han utilizado las fórmulas de cortesía propias del documento que se va a elaborar.",
                                "h": "Se ha escrito correspondencia formal básica en formato físico o digital destinada principalmente a pedir información, solicitar un servicio o llevar a cabo una reclamación u otra gestión sencilla, siempre atendiendo a las convenciones de la tipología textual.",
                                "i": "Se han tomado notas, y mensajes, con información sencilla sobre aspectos propios de su labor profesional.",
                                "j": "Se ha solicitado, de forma escrita, información referente a aspectos relacionados con su campo profesional (página web y correo electrónico, entre otros"}},
            "RA05": {
                    "Resultado": " Aplica actitudes y comportamientos profesionales en situaciones de comunicación, describiendo las relaciones típicas características del país de la lengua extranjera.",
                        "CriteriosEvaluacion": {
                                "a": "Se han definido los rasgos más significativos de las costumbres y usos de la comunidad donde se habla la lengua extranjera.",
                                "b": "Se han descrito los protocolos y normas de relación social propios del país.",
                                "c": "Se han identificado los valores y creencias propios de la comunidad donde se habla la lengua extranjera.",
                                "d": "Se han identificado los aspectos socio-profesionales propios del sector, en cualquier tipo de texto.",
                                "e": "Se han aplicado los protocolos y normas de relación social propios del país de la lengua extranjera."
                                }
        }


		},
		"horas":"50",
		"UnidadesCompetenciaAcreditadas":{}
    },
    "1664": {
            "nombre": "Digitalización aplicada a los sectores productivos (GM)",
            "creditos": "3",
            "ResultadosAprendizaje": {
                "RA01": {
                    "Resultado": " Establece las diferencias entre la Economía Lineal (EL) y la Economía Circular (EC), identificando las ventajas de la EC en relación con el medioambiente y el desarrollo sostenible.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado las etapas «típicas» de los modelos basados en EL y modelos basados en EC.",
                                "b": "Se ha analizado cada etapa de los modelos EL y EC y su repercusión en el medio ambiente.",
                                "c": "Se ha valorado la importancia del reciclaje en los modelos económicos.",
                                "d": "Se han identificado procesos reales basados en EL.",
                                "e": "Se han identificado procesos reales basados en EC.",
                                "f": "Se han comparado los modelos anteriores en relación con su impacto medioambiental y los ODS"}},
                "RA02": {
                    "Resultado": " Caracteriza los principales aspectos de la 4.ª Revolución Industrial indicando los cambios y las ventajas que se producen tanto desde el punto de vista de los clientes como de las empresas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han relacionado los sistemas ciber físicos con la evolución industrial.",
                                "b": "Se ha analizado el cambio producido en los sistemas automatizados.",
                                "c": "Se ha descrito la combinación de la parte física de las industrias con el software, IoT (Internet de las cosas)",
                                "d": "Se ha descrito la interrelación entre el mundo físico y el virtual.",
                                "e": "Se ha relacionado la migración a entornos 4.0 con la mejora de los resultados de las empresas.",
                                "f": "Se han identificado las ventajas para clientes y empresas."}},
                "RA03": {
                    "Resultado": " Identifica la estructura de los sistemas basados en cloud/nube describiendo su tipología y campo de aplicación.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado los diferentes niveles de la cloud/nube.",
                                "b": "Se han identificado las principales funciones de la cloud/nube (procesamiento de datos, intercambio de información, ejecución de aplicaciones, entre otros",
                                "c": "Se ha descrito el concepto de edge computing y su relación con la cloud/nube.",
                                "d": "Se han definido los conceptos de fog y mist y sus zonas de aplicación en el conjunto.",
                                "e": "Se han identificado las ventajas que proporciona la utilización de la cloud/nube en los sistemas conectados."}},
                "RA04": {
                    "Resultado": " Compara los sistemas de producción/prestación de servicios digitalizados con los sistemas clásicos identificando las mejoras introducidas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado las tecnologías habilitadoras (THD).",
                                "b": "Se han descrito las características y aplicaciones del IoT, IA (Inteligencia Artificial, Big Data, tecnología 5G, la robótica colaborativa, Blockchain, Ciberseguridad, fabricación aditiva, realidad virtual, gemelos digitales, entre otras).",
                                "c": "Se ha descrito la contribución de las THD a la mejora de la productividad y la eficiencia de los sistemas productivos o de prestación de servicios.",
                                "d": "Se ha relacionado la alineación entre las unidades funcionales de las empresas que conforman el sistema y el objetivo del mismo.",
                                "e": "Se ha relacionado la implantación de las tecnologías habilitadoras (sensórica, tratamiento de datos, automatización y comunicaciones, entre otras con la reducción de costes y la mejora de la competitividad.",
                                "f": "Se han relacionado las tecnologías disruptivas con aplicaciones concretas en los sectores productivos.",
                                "g": "Se han definido los sistemas de almacenamiento de datos no convencionales y el acceso a los mismos desde cada unidad.",
                                "h": "Se han descrito las mejoras producidas en el sistema y en cada una de sus etapas."}},
                "RA05": {
                    "Resultado": " Elabora un plan de transformación de una empresa clásica del sector en el que se enmarca el título, basada en una EL, al concepto 4.0, determinando los cambios a introducir en las principales fases del sistema e indicando como afectaría a los recursos humanos.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha definido a nivel de bloques el diagrama de funcionamiento de la empresa clásica.",
                                "b": "Se han identificado las etapas susceptibles de ser digitalizadas.",
                                "c": "Se han definido las tecnologías implicadas en cada una de las etapas.",
                                "d": "Se ha establecido la conexión de las etapas digitalizadas con el resto del sistema.",
                                "e": "Se ha elaborado un diagrama de bloques del sistema digitalizado.",
                                "f": "Se ha elaborado un informe de viabilidad y de las mejoras introducidas.",
                                "g": "Se ha analizado la mejora en la producción y gestión de residuos, entre otras.",
                                "h": "Se ha elaborado un documento con la secuencia del plan de transformación y los recursos empleados."
                                }
                }

            },
            "horas": "30",
            "UnidadesCompetenciaAcreditadas": {},
            "ObjetivosGenerales ": ["e","j","q"],
            "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
    },
    "1709": {
            "nombre": "Itinerario personal para la empleabilidad I",
            "creditos": "5",
            "ResultadosAprendizaje": {
                "RA01": {
                    "Resultado": " Distingue las características del sector productivo y define los puestos de trabajo relacionándolos con las competencias profesionales expresadas en el título.",
                        "CriteriosEvaluacion": {
                                "a": "Se han analizado las principales oportunidades de empleo y de inserción laboral en el sector profesional, identificando las posibilidades de empleo y analizado sus requerimientos actuales para el perfil profesional.",
                                "b": "Se ha comparado los diferentes requerimientos exigidos por el mercado laboral con las exigencias para el trabajo en la función pública relacionados con el sector privado.",
                                "c": "Se ha reflexionado sobre las actitudes y aptitudes requeridas actualmente para la actividad profesional relacionadas con el título, así como las competencias personales y sociales más relevantes para el sector identificando nuestra zona de desarrollo próximo."}},
                "RA02": {
                    "Resultado": " Adquiere las competencias necesarias para el desempeño de las funciones de nivel básico en Prevención de Riesgos Laborales.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha valorado la importancia de la cultura preventiva en todos los ámbitos actividades de la empresa u organismo equiparado relacionado las condiciones laborales con la salud de la persona trabajadora identificando y clasificando los factores de riesgo en la actividad y los daños derivados de los mismos, especialmente las situaciones de riesgo más habituales en los entornos de trabajo del sector profesional relacionado con el título.",
                                "b": "Se han clasificado y descrito los tipos de daños profesionales, con especial referencia a accidentes de trabajo y enfermedades profesionales, relacionados con el perfil profesional del título.",
                                "c": "Se ha determinado la evaluación de riesgos en la empresa u organismo equiparado y definido las técnicas de prevención y de protección que deben aplicarse para evitar los daños en su origen y minimizar sus consecuencias.",
                                "d": "Se han analizado los protocolos de actuación en caso de emergencia.",
                                "e": "Se han determinado los principales derechos y deberes en materia de prevención de riesgos laborales.",
                                "f": "Se han clasificado las distintas formas de gestión de la prevención en la empresa u organismo equiparado, en función de los distintos criterios establecidos en la normativa sobre prevención de riesgos laborales y determinado las formas de representación de las personas trabajadoras en la empresa u organismo equiparado en materia de prevención de riesgos.",
                                "g": "Se ha valorado la importancia de la existencia de un plan preventivo en la empresa u organismo equiparado que incluya la secuenciación de actuaciones a realizar en caso de emergencia y reflexionado sobre el contenido del mismo.",
                                "h": "Se han determinado los requisitos y condiciones para la vigilancia de la salud de la persona trabajadora y su importancia como medida de prevención.",
                                "i": "Se han identificado las técnicas básicas de primeros auxilios que han de ser aplicadas en el lugar del accidente ante distintos tipos de daños y la composición y uso del botiquín." }},
                "RA03": {
                    "Resultado": " Analiza sus condiciones laborales como persona trabajadora por cuenta ajena identificándolas en los principales tipos de cambios y vicisitudes relevantes que se pueden presentar en la relación laboral en la normativa laboral y especialmente en el convenio colectivo del sector.",
                        "CriteriosEvaluacion": {
                                "a": "Se han analizado los derechos y obligaciones derivados de la relación laboral, así como las condiciones de trabajo pactadas en un convenio colectivo aplicable al sector profesional relacionado con el título.",
                                "b": "Se han comparado las principales modalidades de contratación, localizando los diferentes modelos en las fuentes oficiales.",
                                "c": "Se han identificado las características definitorias de los nuevos entornos de organización del trabajo y los derechos que conlleva.",
                                "d": "Se han identificado los diferentes componentes del recibo de salario.",
                                "e": "Se han identificado los recursos laborales existentes ante las diferentes vicisitudes que se pueden dar en la relación laboral.",
                                "f": "Se ha valorado el papel de laSeguridad Social como pilar esencial para la mejora de la calidad de vida de los ciudadanos.",
                                "g": "Se han analizado las principales prestaciones derivadas de la suspensión y extinción de la relación laboral."}},
                "RA04": {
                    "Resultado": " Analiza y evalúa su potencial profesional y sus intereses para guiarse en el proceso de autoorientación y elabora una hoja de ruta para la inserción profesional en base al análisis de las competencias, intereses y destrezas personales.",
                        "CriteriosEvaluacion": {
                                "a": "Se han evaluado los propios intereses, motivaciones, habilidades y destrezas en el marco de un proceso de autoconocimiento.",
                                "b": "Se han analizado las cualidades y competencias personales afines a la actividad profesional relacionada con el perfil del título.",
                                "c": "Se han determinado las competencias personales y sociales con valor para el empleo.",
                                "d": "Se han señalado las preferencias profesionales, intereses y metas en el marco de un proyecto profesional.",
                                "e": "Se ha valorado el concepto de autoestima en el proceso de búsqueda de empleo.",
                                "f": "Se han identificado las fortalezas, debilidades, amenazas y oportunidades propias para la inserción profesional.",
                                "g": "Se han identificado expectativas de futuro para inserción profesional analizando competencias, intereses y destrezas personales.",
                                "h": "Se han valorado hitos importantes en la trayectoria vital con valor profesionalizador.",
                                "i": "Se han identificado los itinerarios formativos profesionales relacionados con el perfil profesional.",
                                "j": "Se han formulado objetivos profesionales y se ha determinado metas personales y profesionales para la mejora de la empleabilidad y las condiciones de inserción laboral.",
                                "k": "Se ha trazado un plan de acción para desarrollar las áreas de mejora y potenciar las fortalezas personales con valor para el empleo."}},
                "RA05": {
                    "Resultado": " Aplica las estrategias para el aprendizaje autónomo reconociendo su valor profesionalizador, diseñando y optimizando su propio entorno de aprendizaje haciendo uso de las tecnologías digitales como herramientas de aprendizaje autónomo, siendo coherente con su identidad digital y sus propios objetivos profesionales planteados en su plan de desarrollo individual.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha tomado conciencia de la responsabilidad individual en el desarrollo profesional valorando la actitud de aprendizaje permanente para el desarrollo de propias y nuevas competencias.",
                                "b": "Se ha identificado la empleabilidad como capacidad de adaptación al entorno laboral.",
                                "c": "Se han conocido y utilizado herramientas, fuentes de información, conexiones y actividades para la configuración de un entorno personal de aprendizaje para la empleabilidad.",
                                "d": "Se ha puesto en práctica la competencia digital para configurar un entorno personal de aprendizaje para la empleabilidad.",
                                "e": "Se ha analizado el concepto de identidad digital y su impacto en la empleabilidad.",
                                "f": "Se ha justificado el diseño de su entorno de aprendizaje basado en cómo este mejora la empleabilidad.",
                                "g": "Se ha elaborado su plan de desarrollo individual como herramienta para la mejora de la empleabilidad.",
                                "h": "Se han aplicado las herramientas de aprendizaje autónomo para su desarrollo personal y profesional.",
                                "i": "Se ha diseñado el entorno de aprendizaje que permite alcanzar el plan de desarrollo individual."}}
            },
            "horas": "50",
            "UnidadesCompetenciaAcreditadas": {},
            "ObjetivosGenerales ": ["e","j","q"],
            "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
    },
    "1710": {
            "nombre": "Itinerario personal para la empleabilidad II",
            "creditos": "5",
            "ResultadosAprendizaje": {
                "RA01": {
                    "Resultado": " Planifica y pone en marcha estrategias en los diferentes procesos selectivos de empleo que le permiten mejorar sus posibilidades de inserción laboral.",
                        "CriteriosEvaluacion": {
                                "a": "Se han determinado las técnicas utilizadas actualmente en el sector para el proceso de selección de personal.",
                                "b": "Se han desarrollado estrategias para la búsqueda de empleo relacionadas con las técnicas actuales más utilizadas contextualizadas al sector.",
                                "c": "Se han valorado las actitudes y aptitudes que permiten superar procesos selectivos en el sector privado y en el sector público.",
                                "d": "Se ha construido una marca personal identificando las necesidades del mercado actual, sus habilidades, destrezas y su aporte de valor."}},
                "RA02": {
                    "Resultado": " Aplica estrategias relacionadas con las competencias personales, sociales y emocionales para el empleo en búsqueda de la mejora de su empleabilidad.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha valorado la importancia de las competencias personales y sociales en la empleabilidad en el sector de referencia.",
                                "b": "Se ha participado activamente en el establecimiento de los objetivos del equipo y en la toma de decisiones del mismo y asumido la responsabilidad de las acciones y decisiones del grupo, participando activamente en el logro de unos objetivos compartidos cooperando con otras personas y compartiendo el liderazgo.",
                                "c": "Se han incorporado al propio proceso de aprendizaje las técnicas y recursos de presentación y comunicación, tanto orales como escritos, adecuados para una comunicación efectiva y afectiva siendo capaz de adaptarlos a cada situación y circunstancias, valorando las oportunidades y dificultades que ofrece cada una de ellas.",
                                "d": "Se han aplicado técnicas y estrategias para la gestión del tiempo disponible para alcanzar los objetivos tanto individuales como del equipo y programado las actividades necesarias.",
                                "e": "Se han aplicado estrategias para canalizar las emociones mostrando una actitud flexible en las relaciones con otras personas.",
                                "f": "Se han desarrollado estrategias para la programación de actividades atendiendo a criterios de organización eficiente y previendo las posibles dificultades.",
                                "g": "Se ha reaccionado de forma flexible y positiva ante conflictos y situaciones nuevas, aprovechando las oportunidades y gestionando las dificultades haciendo uso de estrategias relacionadas con la inteligencia emocional."}},
                "RA03": {
                    "Resultado": " Pone en práctica las habilidades emprendedoras necesarias para el desarrollo de procesos de innovación e investigación aplicadas que promuevan la modernización del sector productivo hacia un modelo sostenible.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha identificado el concepto de innovación y su relación con la construcción de una sociedad más sostenible que mejore en el bienestar de los individuos.",
                                "b": "Se han analizado las distintas metodologías para emprender y su importancia para favorecer la innovación y como fuente de creación de empleo y bienestar social.",
                                "c": "Se han aplicado las habilidades emprendedoras necesarias para promover el emprendimiento y el intraemprendimiento.",
                                "d": "Se ha puesto en práctica el trabajo colaborativo como requisito para el desarrollo de procesos de innovación.",
                                "e": "Se ha desarrollado la competencia digital necesaria para la mejora de los procesos de innovación e investigación aplicadas que promuevan la modernización del sector productivo.",
                                "f": "Se han incorporado los objetivos de las políticas e iniciativas relacionadas con la sostenibilidad y el medio ambiente a la estrategia empresarial enfocada al desarrollo de un modelo económico y social sostenible."}},
                "RA04": {
                    "Resultado": " Identifica, define y valida ideas de emprendimiento generadoras de nuevas oportunidades a partir de estrategias de análisis del entorno socio productivo utilizando metodologías ágiles para el emprendimiento.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado los problemas de las personas destinatarias potenciales del proyecto emprendedor como paso previo a la propuesta de soluciones que se conviertan en oportunidades.",
                                "b": "Se ha puesto en práctica el proceso creativo con el fin de conseguir una idea emprendedora que aporte valor económico, social y/o cultural.",
                                "c": "Se ha diseñado un modelo de negocio y/o gestión derivado de la idea emprendedora.",
                                "d": "Se han incorporado valores éticos y sociales a la idea emprendedora analizando modelos de balance social.",
                                "e": "Se ha analizado la contribución de la Economía Circular y la Economía del Bien Común al desarrollo de un modelo económico y social basado en la equidad, la justicia social y la sostenibilidad.",
                                "f": "Se han analizado los principales componentes del entorno general y específico, y su impacto en la idea emprendedora.",
                                "g": "Se han realizado entrevistas de problema para validar el perfil y el problema de las personas destinatarias de la idea emprendedora.",
                                "h": "Se ha validado la solución mediante la creación de prototipos buscando el encaje problema-solución.",
                                "i": "Se ha experimentado con la puesta en práctica de estrategias de marketing para desarrollar destrezas en técnicas de comunicación y venta."}},
                "RA05": {
                    "Resultado": " Desarrolla un proyecto emprendedor de innovación social y/o tecnológica aplicada en colaboración con el entorno.",
                        "CriteriosEvaluacion": {
                                "a": "Se han analizado los conceptos básicos del emprendimiento y la innovación social.",
                                "b": "Se ha reflexionado sobre la necesidad del liderazgo ético y sostenible en las organizaciones.",
                                "c": "Se ha reflexionado sobre la tecnología como base para el cambio del modelo productivo.",
                                "d": "Se han puesto en marcha las estrategias propias del pensamiento de diseño para detectar necesidades sociales y medioambientales.",
                                "e": "Se han analizado los elementos del diseño de modelos de negocio ecosociales y/o de base tecnológica.",
                                "f": "Se han alineado metas de desarrollo sostenible con el diseño de modelos de negocio ecosociales y/o de base tecnológica.",
                                "g": "Se han aplicado las estrategias necesarias para analizar la viabilidad del proyecto emprendedor.",
                                "h": "Se han investigado las opciones financieras socialmente responsables.",
                                "i": "Se han definido los agentes implicados en el proyecto, así como su participación en el mismo."
                                }
                    }
            },
            "horas": "50",
            "UnidadesCompetenciaAcreditadas": {},
            "ObjetivosGenerales ": ["e","j","q"],
            "CompetenciasTitulo" : ["a","e","f","i","j","v","y","z" ]
    },
    "1708":{
                "nombre": "Sostenibilidad aplicada al sistema productivo",
                "creditos": "5",
                "ResultadosAprendizaje": {
                    "RA01": {
                        "Resultado": " Identifica los aspectos ambientales, sociales y de gobernanza (ASG) relativos a la sostenibilidad teniendo en cuenta el concepto de desarrollo sostenible y los marcos internacionales que contribuyen a su consecución.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha descrito el concepto de sostenibilidad, estableciendo los marcos internacionales asociados al desarrollo sostenible.",
                                    "b": "Se han identificado los asuntos ambientales, sociales y de gobernanza que influyen en el desarrollo sostenible de las organizaciones empresariales.",
                                    "c": "Se han relacionado los Objetivos de Desarrollo Sostenible ODS,con su importancia para la consecución de la Agenda 2030.",
                                    "d": "Se ha analizado la importancia de identificar los aspectos ASG más relevantes para los grupos de interés de las organizaciones relacionándolos con los riesgos y oportunidades que suponen para la propia organización.",
                                    "e": "Se han identificado los principales estándares de métricas para la evaluación del desempeño en sostenibilidad y su papel en la rendición de cuentas que marca la legislación vigente y las futuras regulaciones en desarrollo.",
                                    "f": "Se ha descrito la inversión socialmente responsable y el papel de los analistas, inversores, agencias e índices de sostenibilidad en el fomento de la sostenibilidad."}},
                    "RA02": {
                        "Resultado": " Caracteriza los retos ambientales y sociales a los que se enfrenta la sociedad, describiendo los impactos sobre las personas y los sectores productivos y proponiendo acciones para minimizarlos.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los principales retos ambientales y sociales.",
                                    "b": "Se han relacionado los retos ambientales y sociales con el desarrollo de la actividad económica.",
                                    "c": "Se ha analizado el efecto de los impactos ambientales y sociales sobre las personas y los sectores productivos.",
                                    "d": "Se han identificado las medidas y acciones encaminadas a minimizar los impactos ambientales y sociales.",
                                    "e": "Se ha analizado la importancia de establecer alianzas y trabajar de manera transversal y coordinada para abordar con éxito los retos ambientales y sociales."}},
                    "RA03": {
                        "Resultado": " Establece la aplicación de criterios de sostenibilidad en el desempeño profesional y personal, identificando los elementos necesarios.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los ODS más relevantes para la actividad profesional que realiza.",
                                    "b": "Se han analizado los riesgos y oportunidades que representan los ODS.",
                                    "c": "Se han identificado las acciones necesarias para atender algunos de los retos ambientales y sociales desde la actividad profesional y el entorno personal."}},
                    "RA04": {
                        "Resultado": " Propón productos y servicios responsables teniendo en cuenta los principios de la economía circular.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha caracterizado el modelo de producción y consumo actual.",
                                    "b": "Se han identificado los principios de la economía verde y circular.",
                                    "c": "Se han contrastado los beneficios de la economía verde y circular frente al modelo clásico de producción.",
                                    "d": "Se han aplicado principios de ecodiseño.",
                                    "e": "Se ha analizado el ciclo de vida del producto.",
                                    "f": "Se han identificado los procesos de producción y los criterios de sostenibilidad aplicados."}},
                    "RA05": {
                        "Resultado": " Realiza actividades sostenibles minimizando el impacto de las mismas en el medio ambiente.",
                            "CriteriosEvaluacion": {
                                    "a": "Se ha caracterizado el modelo de producción y consumo actual.",
                                    "b": "Se han identificado los principios de la economía verde y circular.",
                                    "c": "Se han contrastado los beneficios de la economía verde y circular frente al modelo clásico de producción.",
                                    "d": "Se ha evaluado el impacto de las actividades personales y profesionales.",
                                    "e": "Se han aplicado principios de ecodiseño.",
                                    "f": "Se han aplicado estrategias sostenibles.",
                                    "g": "Se ha analizado el ciclo de vida del producto.",
                                    "h": "Se han identificado los procesos de producción y los criterios de sostenibilidad aplicados.",
                                    "i": "Se ha aplicado la normativa ambiental."}},
                    "RA06": {
                        "Resultado": " Analiza un plan de sostenibilidad de una empresa del sector, identificando sus grupos de interés, los aspectos ASG materiales y justificando acciones para su gestión y medición.",
                            "CriteriosEvaluacion": {
                                    "a": "Se han identificado los principales grupos de interés de la empresa.",
                                    "b": "Se han analizado los aspectos ASG materiales, las expectativas de los grupos de interés y la importancia de los aspectos ASG en relación con los objetivos empresariales.",
                                    "c": "Se han definido acciones encaminadas a minimizar los impactos negativos y aprovechar las oportunidades que plantean los principales aspectos ASG identificados.",
                                    "d": "Se han determinado las métricas de evaluación del desempeño de la empresa de acuerdo con los estándares de sostenibilidad más ampliamente utilizados.",
                                    "e": "Se ha elaborado un informe de sostenibilidad con el plan y los indicadores propuestos."
                                    }
                        }
                    },
                "horas": "34",
                "UnidadesCompetenciaAcreditadas": {},
                "ObjetivosGenerales ": [],
                "CompetenciasTitulo" : []
    },
    "0221":{
            "nombre":"Montaje y mantenimiento de equipos",
            "horas": "233",
            "UnidadesCompetenciaAcreditadas" : {},
            "ObjetivosGenerales" : ["a", "b", "c", "g", "h", "i", "j", "k" , "l"],
            "CompetenciasTitulo" : ["a", "b", "g", "h", "i", "j", "k" , "l"],
            "creditos":"0",
            "ResultadosAprendizaje":{
                "RA01": {
                    "Resultado": " Selecciona los componentes de integración de un equipo microinformático estándar, describiendo sus funciones y comparando prestaciones de distintos fabricantes.",
                        "CriteriosEvaluacion": {
                                "a": "Se han descrito los bloques que componen un equipo microinformático y sus funciones.",
                                "b": "Se ha reconocido la arquitectura de buses.",
                                "c": "Se han descrito las características de los tipos de microprocesadores (frecuencia, tensiones, potencia, zócalos, entre otros)",
                                "d": "Se ha descrito la función de los disipadores y ventiladores.",
                                "e": "Se han descrito las características y utilidades más importantes de la configuración de la placa base.",
                                "f": "Se han evaluado tipos de chasis para la placa base y el resto de componentes.",
                                "g": "Se han identificado y manipulado los componentes básicos (módulos de memoria, discos fijos y sus controladoras, soportes de memorias auxiliares, entre otros).",
                                "h": "Se ha analizado la función del adaptador gráfico y el monitor.",
                                "i": "Se han identificado y manipulado distintos adaptadores (gráficos, LAN, modems, entre otros).",
                                "j": "Se han identificado los elementos que acompañan a un componente de integración (documentación, controladores, cables y utilidades, entre otros)."}},
                "RA02": {
                    "Resultado": " Ensambla un equipo microinformático, interpretando planos e instrucciones del fabricante aplicando técnicas de montaje.",
                        "CriteriosEvaluacion": {
                                "a": "Se han seleccionado las herramientas y útiles necesarios para el ensamblado de equipos microinformáticos.",
                                "b": "Se ha interpretado la documentación técnica de todos los componentes a ensamblar.",
                                "c": "Se ha determinado el sistema de apertura / cierre del chasis y los distintos sistemas de fijación para ensamblar-desensamblar los elementos del equipo.",
                                "d": "Se han ensamblado diferentes conjuntos de placa base, microprocesador y elementos de refrigeración en diferentes modelos de chasis, según las especificaciones dadas.",
                                "e": "Se han ensamblado los módulos de memoria RAM, los discos fijos, las unidades de lectura / grabación en soportes de memoria auxiliar y otros componentes.",
                                "f": "Se han configurado parámetros básicos del conjunto accediendo a la configuración de la placa base.",
                                "g": "Se han ejecutado utilidades de chequeo y diagnóstico para verificar las prestaciones del conjunto ensamblado.",
                                "h": "Se ha realizado un informe de montaje."}},
                "RA03": {
                    "Resultado": " Mide parámetros eléctricos, identificando el tipo de señal y relacionándola con sus unidades características.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha identificado el tipo de señal a medir con el aparato correspondiente.",
                                "b": "Se ha seleccionado la magnitud, el rango de medida y se ha conectado el aparato según la magnitud a medir.",
                                "c": "Se ha relacionado la medida obtenida con los valores típicos.",
                                "d": "Se han identificado los bloques de una fuente de alimentación (F.A.) para un ordenador personal.",
                                "e": "Se han enumerado las tensiones proporcionadas por una F.A. típica.",
                                "f": "Se han medido las tensiones en F.A. típicas de ordenadores personales.",
                                "g": "Se han identificado los bloques de un sistema de alimentación ininterrumpida.",
                                "h": "Se han medido las señales en los puntos significativos de un SAI."}},
                "RA04": {
                    "Resultado": " Mantiene equipos informáticos interpretando las recomendaciones de los fabricantes y relacionando las disfunciones con sus causas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han reconocido las señales acústicas y/o visuales que avisan de problemas en el hardware de un equipo.",
                                "b": "Se han identificado y solventado las averías producidas por sobrecalentamiento del microprocesador.",
                                "c": "Se han identificado y solventado averías típicas de un equipo microinformático (mala conexión de componentes, incompatibilidades, problemas en discos fijos, suciedad, entre otras).",
                                "d": "Se han sustituido componentes deteriorados.",
                                "e": "Se ha verificado la compatibilidad de los componentes sustituidos.",
                                "f": "Se han realizado actualizaciones y ampliaciones de componentes.",
                                "g": "Se han elaborado informes de avería (reparación o ampliación)."}},
                "RA05": {
                    "Resultado": " Instala software en un equipo informático utilizando una imagen almacenada en un soporte de memoria y justificando el procedimiento a seguir.",
                        "CriteriosEvaluacion": {
                                "a": "Se ha reconocido la diferencia entre una instalación estándar y una preinstalación de software.",
                                "b": "Se han identificado y probado las distintas secuencias de arranque configurables en la placa base.",
                                "c": "Se han inicializado equipos desde distintos soportes de memoria auxiliar.",
                                "d": "Se han realizado imágenes de una preinstalación de software.",
                                "e": "Se han restaurado imágenes sobre el disco fijo desde distintos soportes.",
                                "f": "Se han descrito las utilidades para la creación de imágenes de partición/disco."}},
                "RA06": {
                    "Resultado": " Reconoce nuevas tendencias en el ensamblaje de equipos microinformáticos describiendo sus ventajas y adaptándolas a las características de uso de los equipos.",
                        "CriteriosEvaluacion": {
                                "a": "Se han reconocido las nuevas posibilidades para dar forma al conjunto chasis-placa base.",
                                "b": "Se han descrito las prestaciones y características de algunas de las plataformas semiensambladas («barebones») más representativas del momento.",
                                "c": "Se han descrito las características de los ordenadores de entretenimiento multimedia (HTPC), los chasis y componentes específicos empleados en su ensamblado.",
                                "d": "Se han descrito las características diferenciales que demandan los equipos informáticos empleados en otros campos de aplicación específicos.",
                                "e": "Se ha evaluado la presencia de la informática móvil como mercado emergente, con una alta demanda en equipos y dispositivos con características específicas: móviles, PDA, navegadores, entre otros.",
                                "f": "Se ha evaluado la presencia del «modding» como corriente alternativa al ensamblado de equipos microinformáticos."}},
                "RA07": {
                    "Resultado": " Mantiene periféricos, interpretando las recomendaciones de los fabricantes de equipos y relacionando disfunciones con sus causas.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado y solucionado problemas mecánicos en periféricos de impresión estándar.",
                                "b": "Se han sustituido consumibles en periféricos de impresión estándar.",
                                "c": "Se han identificado y solucionado problemas mecánicos en periféricos de entrada.",
                                "d": "Se han asociado las características y prestaciones de los periféricos de captura de imágenes digitales, fijas y en movimiento con sus posibles aplicaciones.",
                                "e": "Se han asociado las características y prestaciones de otros periféricos multimedia con sus posibles aplicaciones.",
                                "f": "Se han reconocido los usos y ámbitos de aplicación de equipos de fotocopiado, impresión digital profesional y filmado.",
                                "g": "Se han aplicado técnicas de mantenimiento preventivo a los periféricos."}},
                "RA08": {
                    "Resultado": " Cumple las normas de prevención de riesgos laborales y de protección ambiental, identificando los riesgos asociados, las medidas y equipos para prevenirlos.",
                        "CriteriosEvaluacion": {
                                "a": "Se han identificado los riesgos y el nivel de peligrosidad que suponen la manipulación de los materiales, herramientas, útiles, máquinas y medios de transporte.",
                                "b": "Se han operado las máquinas respetando las normas de seguridad.",
                                "c": "Se han identificado las causas más frecuentes de accidentes en la manipulación de materiales, herramientas, máquinas de corte y conformado, entre otras.",
                                "d": "Se han descrito los elementos de seguridad (protecciones, alarmas, pasos de emergencia, entre otros) de las máquinas y los equipos de protección individual (calzado, protección ocular, indumentaria, entre otros) que se deben emplear en las distintas operaciones de montaje y mantenimiento.",
                                "e": "Se ha relacionado la manipulación de materiales, herramientas y máquinas con las medidas de seguridad y protección personal requeridos.",
                                "f":"Se han identificado las posibles fuentes de contaminación del entorno ambiental.",
                                "g": "Se han clasificado los residuos generados para su retirada selectiva.",
                                "h": "Se ha valorado el orden y la limpieza de instalaciones y equipos como primer factor de prevención de riesgos."
                                }
                        }
            }
        }
    }
}
